{
    "positive": [
        "If this option is specified, hard wrapping is disabled for all output formats, regardless of the value given with --width.",
        "Render raw HTML or potentially dangerous URLs, overriding the default (--safe) behavior.",
        "(enabled only when configured with --with-libcurl)",
        "make sense only when -e option is given.",
        "choose method for finding the largest dimension of median cut boxes for splitting, make sense only when -p option (color reduction) is specified.",
        "choose the method for selecting representative color from each median-cut box, make sense only when -p option (color reduction) is specified.",
        "choose resampling method used with -w or -h option (scaling).",
        "Like -pubin and -pubout except RSAPublicKey format is used instead.",
        "No more than one of the PostScript level options (-level1, -level1sep, -level2, -level2sep, -level3, -level3sep) may be given.",
        "The separation handling is the same as for -level2sep.",
        "No more than one of the mode options (-eps, -form) may be given.",
        "The -level1 option cannot be used with -form.",
        "( -help and --help are equivalent",
        "Similar to -layout , but optimized for simple one-column pages.",
        "Similar to -simple , but handles slightly rotated text (e OCR output) better.",
        "This is ignored in all other modes.",
        "This is ignored in all other modes.",
        "( -help and --help are equivalent",
        "This option only has an effect when the output file is created or overwritten and not when it is appended to.",
        "This option only has an effect when the output file is created or overwritten and not when it is appended to.",
        "Each colon delimited series of four values represents the horizontal and vertical offsets from the top and left edges of the image, regardless of the edge specified with the -E option.",
        "Set the horizontal margin of an output page size to # expressed in the current units when sectioning image into columns x rows subimages using the -S cols:rows option.",
        "Set the vertical margin of an output page size to # expressed in the current units when sectioning image into columns x rows submiages using the -S cols:rows option.",
        "This option is only meaningful in conjunction with the -P option to format an image to fit on a specific paper size.",
        "This option only has an effect when the output file is created or overwritten and not when it is appended to.",
        "This option only has an effect when the output file is created or overwritten and not when it is appended to.",
        "Like -dump, but only the first num bytes are output.",
        "If this option is used then -inform will be ignored.",
        "-vv will print more messages than -v.",
        "This option cannot be combined with -o.",
        "Deprecated, use --enh instead",
        "Deprecated, use --no-enh instead More information is available from the Speex site: http://wwwspeexorg Please report bugs to the mailing list `speex-dev@xiphorg.",
        "Overwrite target file even if it exists (when using -d option).",
        "If this option is specified then any other --strip-* or --keep-* options are ignored.",
        "Like -r but jq wont print a newline after each output.",
        "Use --slurpfile instead.",
        "(This option is like --slurpfile, but when the file has just one text, then that is used, else an array of texts is used as in --slurpfile.)",
        "This must be the last option given and does not honor all preceding options.",
        "Note that this will cause jpegtran to ignore any APP2 markers in the input file, even if -copy all or -copy icc is specified.",
        "Same as -verbose .",
        "This option must appear in combination with the following options: verbose.",
        "By default, -n and -l are used.",
        "This option must appear in combination with the following options: intf2.",
        "This option must not appear in combination with any of the following options: dualfile.",
        "This option must appear in combination with the following options: intf2.",
        "This option must not appear in combination with any of the following options: cachefile.",
        "Generally, it only makes sense to use this option with --cachefile.",
        "This option must appear in combination with the following options: loop.",
        "This option must not appear in combination with any of the following options: pps, mbps, oneatatime, topspeed.",
        "This option must not appear in combination with any of the following options: multiplier, mbps, oneatatime, topspeed.",
        "This option must not appear in combination with any of the following options: multiplier, pps, oneatatime, topspeed.",
        "This option must not appear in combination with any of the following options: mbps, multiplier, pps, oneatatime.",
        "This option must not appear in combination with any of the following options: mbps, pps, multiplier, topspeed.",
        "This option must appear in combination with the following options: pps.",
        "This option must appear in combination with the following options: loop.",
        "This option must appear in combination with the following options: unique-ip.",
        "Assumes both --loop and --unique-ip.",
        "This option must not appear in combination with any of the following options: no-flow-stats.",
        "This option must not appear in combination with any of the following options: cidr, port, regex, mac.",
        "Once all the packets are processed, the results are weighed according to the server/client ratio (--ratio) and systems are assigned an interface.",
        "This option must not appear in combination with any of the following options: auto, port, regex, mac.",
        "This option must not appear in combination with any of the following options: auto, port, cidr, mac.",
        "This option must not appear in combination with any of the following options: auto, regex, cidr, mac.",
        "This option must not appear in combination with any of the following options: auto, regex, cidr, port.",
        "This option must not appear in combination with any of the following options: exclude.",
        "This option must not appear in combination with any of the following options: include.",
        "This option must appear in combination with the following options: port.",
        "This option must appear in combination with the following options: auto.",
        "This option must appear in combination with the following options: auto.",
        "This option must appear in combination with the following options: auto.",
        "This option must appear in combination with the following options: verbose.",
        "Suppress some error output (counterpart to --verbose).",
        "This option conflicts with -i.",
        "This option is equivalent to using the option -D 5.",
        "This option conflicts with -c."
    ],
    "negative": [
        "Specify output format (html, man, xml, latex, commonmark).",
        "Specify a column width to which to wrap the output.",
        "For no wrapping, use the value 0",
        "(the default).",
        "This option currently only affects the commonmark, latex, and man renderers.",
        "Render soft breaks (newlines inside paragraphs in the CommonMark source) as hard line breaks in the target format.",
        "If this option is specified, hard wrapping is disabled for CommonMark output, regardless of the value given with --width.",
        "Render soft breaks as spaces.",
        "Include source position attribute.",
        "Validate UTF-8, replacing illegal sequences with U+FFFD.",
        "Use smart punctuation.",
        "Straight double and single quotes will be rendered as curly quotes, depending on their position.",
        "-- will be rendered as an en-dash.",
        "--- will be rendered as an em-dash. .",
        "will be rendered as ellipses.",
        "Omit raw HTML and potentially dangerous URLs (default).",
        "Raw HTML is replaced by a placeholder comment and potentially dangerous URLs are replaced by empty strings.",
        "Potentially dangerous URLs are those that begin with `javascript:`, `vbscript:`, `file:`, or `data:` (except for `image/png`, `image/gif`, `image/jpeg`, or `image/webp` mime types).",
        "Print usage information.",
        "Print version.",
        "specify output file name (default:stdout).",
        "generate a sixel image for 7bit terminals or printers (default).",
        "generate a sixel image for 8bit terminals or printers.",
        "limit arguments of DECGRI(!) to 255.",
        "specify number of colors to reduce the image to (default=256).",
        "transform image colors to match this set of colorsspecify map.",
        "output monochrome sixel image.",
        "this option assumes the terminal background color is black.",
        "allow to connect to SSL sites without certs",
        "assume the terminal background color is white.",
        "output 15bpp sixel image",
        "use DECDMAC and DEVINVM sequences to optimize GIF animation rendering.",
        "specify an number argument for DECDMAC and make terminal memorize SIXEL image.",
        "No image is shown if this option is specified",
        "specify an number argument for the score of complexion correction.",
        "COMPLEXIONSCORE must be 1 or more.",
        "render GIF animation without delay.",
        "render animated GIF as a static image.",
        "choose diffusion method which used with color reduction.",
        "DIFFUSIONTYPE is one of them: auto  -> choose diffusion type automatically (default) none  -> do not diffuse fs  -> Floyd-Steinberg method atkinson -> Bill Atkinsons method jajuni -> Jarvis, Judice & Ninke stucki -> Stuckis method burkes -> Burkes method a_dither -> positionally stable arithmetic dither x_dither ->",
        "positionally stable arithmetic xor based dither",
        "FINDTYPE is one of them: auto -> choose finding method automatically (default) norm -> simply comparing the range in RGB space lum -> transforming into luminosities before the comparison",
        "SELECTTYPE is one of them: auto  -> choose selecting method automatically (default) center -> choose the center of the box average -> calculate the color average into the box histogram -> similar with average but considers color histogram",
        "crop source image to fit the specified geometry.",
        "REGION should be formatted as %dx%d+%d+%d.",
        "resize image to specified width.",
        "WIDTH is represented by the following syntax: auto  -> preserving aspect ratio (default) <number>% -> scale width with given percentage <number> -> scale width with pixel counts <number>px -",
        "> scale width with pixel counts",
        "resize image to specified height.",
        "HEIGHT is represented by the following syntax auto  -> preserving aspect ratio (default) <number>% -> scale height with given percentage <number> -> scale height with pixel counts <number>px -> scale height with pixel counts",
        "RESAMPLINGTYPE is one of them: nearest -> Nearest-Neighbor method gaussian -> Gaussian filter hanning -> Hanning filter hamming -> Hamming filter bilinear -> Bilinear filter (default) welsh -> Welsh filter bicubic -> Bicubic filter lanczos2 -> Lanczos-2 filter lanczos3 -> Lanczos-3 filter lanczos4 -> Lanczos-4 filter",
        "select quality of color quanlization.",
        "QUALITYMODE is one of them: auto -> decide quality mode automatically (default) high -> high quality and low speed mode low -> low quality and high speed mode full -> quality and careful speed mode",
        "select loop control mode for GIF animation.",
        "auto -> honer the setting of GIF header (default) force -> always enable loop disable -> always disable loop",
        "select palette color space type.",
        "auto -> choose palette type automatically (default) hls -> use HLS color space rgb -> use RGB color space",
        "select built-in palette type xterm16 -> X default 16 color map xterm256 -> X default 256 color map vt340mono -> VT340 monochrome map vt340color -> VT340 color map",
        "select encoding policy auto -> choose encoding policy automatically (default) fast -> encode as fast as possible size -> encode to as small sixel sequence as possible",
        "specify background color BGCOLOR is represented by the following syntax #rgb",
        "#rrggbb #rrrgggbbb #rrrrggggbbbb rgb:r/g/b rgb:rr/gg/bb rgb:rrr/ggg/bbb rgb:rrrr/gggg/bbbb",
        "penetrate GNU Screen using DCS pass-through sequence.",
        "[[deprecated]] read source images from stdin continuously.",
        "show debugging info.",
        "show version and license info.",
        "print help.",
        "Print out a usage message.",
        "The key input format; unspecified by default.",
        "See openssl-format-options(1) for details.",
        "The key output format; the default is PEM.",
        "See openssl-format-options(1) for details.",
        "Private keys are an SEC1 private key or PKCS#8 format.",
        "Public keys are a SubjectPublicKeyInfo as specified in IETF RFC 3280s0",
        "This specifies the input to read a key from or standard input if this option is not specified.",
        "If the key is encrypted a pass phrase will be prompted for.",
        "This specifies the output filename to write a key to or standard output by is not specified.",
        "If any encryption options are set then a pass phrase will be prompted for.",
        "The output filename should not be the same as the input filename.",
        "The password source for the input and output file.",
        "For more information about the format of arg see openssl-passphrase-options(1).",
        "These options encrypt the private key with the DES, triple DES, IDEA or any other cipher supported by OpenSSL before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that using this command to read in an encrypted key with no encryption option can be used to remove the pass phrase from a key, or by setting the encryption options it can be use to add or change the pass phrase.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the DES, triple DES, IDEA or any other cipher supported by OpenSSL before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that using this command to read in an encrypted key with no encryption option can be used to remove the pass phrase from a key, or by setting the encryption options it can be use to add or change the pass phrase.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the DES, triple DES, IDEA or any other cipher supported by OpenSSL before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that using this command to read in an encrypted key with no encryption option can be used to remove the pass phrase from a key, or by setting the encryption options it can be use to add or change the pass phrase.",
        "These options can only be used with PEM format output files.",
        "Prints out the public, private key components and parameters.",
        "This option prevents output of the encoded version of the key.",
        "Print the elliptic curve parameters.",
        "By default, a private key is read from the input file.",
        "With this option a public key is read instead.",
        "By default a private key is output.",
        "With this option a public key will be output instead.",
        "This option is automatically set if the input is a public key.",
        "This specifies how the points on the elliptic curve are converted into octet strings.",
        "Possible values are: compressed (the default value), uncompressed and hybrid.",
        "For more information regarding the point conversion forms please read the X92 standard.",
        "Note Due to patent issues the compressed option is disabled by default for binary curves and can be enabled by defining the preprocessor macro OPENSSL_EC_BIN_PT_COMP at compile time.",
        "This specifies how the elliptic curve parameters are encoded.",
        "Possible value are: named_curve, i the ec parameters are specified by an OID, or explicit where the ec parameters are explicitly given (see RFC 3279 for the definition of the EC parameters structures).",
        "The default value is named_curve.",
        "Note the implicitlyCA alternative, as specified in RFC 3279, is currently not implemented in OpenSSL.",
        "This option omits the public key components from the private key output.",
        "This option checks the consistency of an EC private or public key.",
        "See Engine Options in openssl(1).",
        "This option is deprecated.",
        "See Provider Options in openssl(1), provider(7), and property(7).",
        "The openssl-pkey(1) command is capable of performing all the operations this command can, as well as supporting other public key types.",
        "Print out a usage message.",
        "The key input format; unspecified by default.",
        "See openssl-format-options(1) for details.",
        "The key output format; the default is PEM.",
        "See openssl-format-options(1) for details.",
        "When writing a private key, use the traditional PKCS#1 format instead of the PKCS#8 format.",
        "This specifies the input to read a key from or standard input if this option is not specified.",
        "If the key is encrypted a pass phrase will be prompted for.",
        "The password source for the input and output file.",
        "For more information about the format of arg see openssl-passphrase-options(1).",
        "This specifies the output filename to write a key to or standard output if this option is not specified.",
        "If any encryption options are set then a pass phrase will be prompted for.",
        "The output filename should not be the same as the input filename.",
        "These options encrypt the private key with the specified cipher before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that this command can be used to remove the pass phrase from a key by not giving any encryption option is given, or to add or change the pass phrase by setting them.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the specified cipher before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that this command can be used to remove the pass phrase from a key by not giving any encryption option is given, or to add or change the pass phrase by setting them.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the specified cipher before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that this command can be used to remove the pass phrase from a key by not giving any encryption option is given, or to add or change the pass phrase by setting them.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the specified cipher before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that this command can be used to remove the pass phrase from a key by not giving any encryption option is given, or to add or change the pass phrase by setting them.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the specified cipher before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that this command can be used to remove the pass phrase from a key by not giving any encryption option is given, or to add or change the pass phrase by setting them.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the specified cipher before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that this command can be used to remove the pass phrase from a key by not giving any encryption option is given, or to add or change the pass phrase by setting them.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the specified cipher before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that this command can be used to remove the pass phrase from a key by not giving any encryption option is given, or to add or change the pass phrase by setting them.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the specified cipher before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that this command can be used to remove the pass phrase from a key by not giving any encryption option is given, or to add or change the pass phrase by setting them.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the specified cipher before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that this command can be used to remove the pass phrase from a key by not giving any encryption option is given, or to add or change the pass phrase by setting them.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the specified cipher before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that this command can be used to remove the pass phrase from a key by not giving any encryption option is given, or to add or change the pass phrase by setting them.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the specified cipher before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that this command can be used to remove the pass phrase from a key by not giving any encryption option is given, or to add or change the pass phrase by setting them.",
        "These options can only be used with PEM format output files.",
        "These options encrypt the private key with the specified cipher before outputting it.",
        "A pass phrase is prompted for.",
        "If none of these options is specified the key is written in plain text.",
        "This means that this command can be used to remove the pass phrase from a key by not giving any encryption option is given, or to add or change the pass phrase by setting them.",
        "These options can only be used with PEM format output files.",
        "Prints out the various public or private key components in plain text in addition to the encoded version.",
        "This option prevents output of the encoded version of the key.",
        "This option prints out the value of the modulus of the key.",
        "This option checks the consistency of an RSA private key.",
        "By default a private key is read from the input file: with this option a public key is read instead.",
        "By default a private key is output: with this option a public key will be output instead.",
        "This option is automatically set if the input is a public key.",
        "Enable Strong PVK encoding level (default).",
        "Enable Weak PVK encoding level.",
        "Dont enforce PVK encoding.",
        "See Engine Options in openssl(1).",
        "This option is deprecated.",
        "See Provider Options in openssl(1), provider(7), and property(7).",
        "Specifies the first page to print.",
        "Specifies the last page to print.",
        "Generate Level 1 PostScript.",
        "The resulting PostScript files will be significantly larger (if they contain images), but will print on Level 1 printers.",
        "This also converts all images to black and white.",
        "[config file: psLevel ]",
        "Generate Level 1 separable PostScript.",
        "All colors are converted to CMYK.",
        "Images are written with separate stream data for the four components.",
        "[config file: psLevel ]",
        "Generate Level 2 PostScript.",
        "Level 2 supports color images and image compression.",
        "This is the default setting.",
        "[config file: psLevel ]",
        "Generate grayscale Level 2 PostScript.",
        "All colors, including images, are converted to grayscale.",
        "[config file: psLevel ]",
        "Generate Level 2 separable PostScript.",
        "All colors are converted to CMYK.",
        "The PostScript separation convention operators are used to handle custom (spot) colors.",
        "[config file: psLevel ]",
        "Generate Level 3 PostScript.",
        "This enables all Level 2 features plus CID font embedding and masked image generation.",
        "[config file: psLevel ]",
        "Generate grayscale Level 3 PostScript.",
        "All colors, including images, are converted to grayscale.",
        "[config file: psLevel ]",
        "Generate Level 3 separable PostScript.",
        "[config file: psLevel ]",
        "Generate an Encapsulated PostScript (EPS) file.",
        "An EPS file contains a single image, so if you use this option with a multi-page PDF file, you must use -f and -l to specify a single page.",
        "Generate a PostScript form which can be imported by software that understands forms.",
        "A form contains a single page, so if you use this option with a multi-page PDF file, you must use -f and -l to specify a single page.",
        "Generate OPI comments for all images and forms which have OPI information.",
        "(This option is only available if pdftops was compiled with OPI support [config file: psOPI ]",
        "By default, any Type 1 fonts which are embedded in the PDF file are copied into the PostScript file.",
        "This option causes pdftops to substitute base fonts instead.",
        "Embedded fonts make PostScript files larger, but may be necessary for readable output.",
        "[",
        "config file: psEmbedType1Fonts ]",
        "By default, any TrueType fonts which are embedded in the PDF file are copied into the PostScript file.",
        "This option causes pdftops to substitute base fonts instead.",
        "Embedded fonts make PostScript files larger, but may be necessary for readable output.",
        "Also, some PostScript interpreters do not have TrueType rasterizers.",
        "[config file: psEmbedTrueTypeFonts ]",
        "By default, any CID PostScript fonts which are embedded in the PDF file are copied into the PostScript file.",
        "This option disables that embedding.",
        "No attempt is made to substitute for non-embedded CID PostScript fonts.",
        "[",
        "config file: psEmbedCIDPostScriptFonts ]",
        "By default, any CID TrueType fonts which are embedded in the PDF file are copied into the PostScript file.",
        "This option disables that embedding.",
        "No attempt is made to substitute for non-embedded CID TrueType fonts.",
        "[",
        "config file: psEmbedCIDTrueTypeFonts ]",
        "Convert PDF forms to PS procedures, and preload image data.",
        "This uses more memory in the PostScript interpreter, but generates significantly smaller PS files in situations where, e the same image is drawn on every page of a long document.",
        "Set the paper size to one of letter, legal, A4, or A3.",
        "This can also be set to match, which will set the paper size to match the size specified in the PDF file.",
        "[config file: psPaperSize ]",
        "Set the paper width, in points.",
        "[config file: psPaperSize ]",
        "Set the paper height, in points.",
        "[config file: psPaperSize ]",
        "By default, output is cropped to the CropBox specified in the PDF file.",
        "This option disables cropping.",
        "[",
        "config file: psCrop ]",
        "Expand PDF pages smaller than the paper to fill the paper.",
        "By default, these pages are not scaled.",
        "[config file: psExpandSmaller ]",
        "Dont scale PDF pages which are larger than the paper.",
        "By default, pages larger than the paper are shrunk to fit.",
        "[config file: psShrinkLarger ]",
        "By default, PDF pages smaller than the paper (after any scaling) are centered on the paper.",
        "This option causes them to be aligned to the lower-left corner of the paper instead.",
        "[",
        "config file: psCenter ]",
        "Treat the CropBox as the PDF page size.",
        "By default, the MediaBox is used as the page size.",
        "[",
        "config file: psUseCropBoxAsPage ]",
        "Honor the UserUnit settings on PDF pages when computing page/paper size.",
        "By default, pdftops ignores UserUnit.",
        "Set the Duplex pagedevice entry in the PostScript file.",
        "This tells duplex-capable printers to enable duplexing.",
        "[config file: psDuplex ]",
        "Specify the owner password for the PDF file.",
        "Providing this will bypass all security restrictions.",
        "Specify the user password for the PDF file.",
        "Dont print any messages or errors.",
        "[config file: errQuiet ]",
        "Read config-file in place of ~/ or the system-wide config file.",
        "Print copyright and version information.",
        "Print usage information.",
        "Specifies the first page to convert.",
        "Specifies the last page to convert.",
        "Maintain (as best as possible) the original physical layout of the text.",
        "The default is to undo physical layout (columns, hyphenation, etc and output the text in reading order.",
        "If the -fixed option is given, character spacing within each line will be determined by the specified character pitch.",
        "This mode will do a better job of maintaining horizontal spacing, but it will only work properly with a single column of text.",
        "Only works for pages with a single column of text.",
        "Table mode is similar to physical layout mode, but optimized for tabular data, with the goal of keeping rows and columns aligned (at the expense of inserting extra whitespace).",
        "If the -fixed option is given, character spacing within each line will be determined by the specified character pitch.",
        "Line printer mode uses a strict fixed-character-pitch and -height layout.",
        "That is, the page is broken into a grid, and characters are placed into that grid.",
        "If the grid spacing is too small for the actual characters, the result is extra whitespace.",
        "If the grid spacing is too large, the result is missing whitespace.",
        "The grid spacing can be specified using the -fixed and -linespacing options.",
        "If one or both are not given on the command line, pdftotext will attempt to compute appropriate value(s).",
        "Keep the text in content stream order.",
        "Depending on how the PDF file was generated, this may or may not be useful.",
        "Specify the character pitch (character width), in points, for physical layout, table, or line printer mode.",
        "Specify the line spacing, in points, for line printer mode.",
        "Text which is hidden because of clipping is removed before doing layout, and then added back in.",
        "This can be helpful for tables where clipped (invisible) text would overlap the next column.",
        "Diagonal text, i text that is not close to one of the 0, 90, 180, or 270 degree axes, is discarded.",
        "This is useful to skip watermarks drawn on top of body text, etc.",
        "Sets the encoding to use for text output.",
        "The encoding-name must be defined with the unicodeMap command (see xpdfrc (5)).",
        "The encoding name is case-sensitive.",
        "This defaults to Latin1 (which is a built-in encoding).",
        "[config file: textEncoding ]",
        "Sets the end-of-line convention to use for text output.",
        "[config file: textEOL ]",
        "Dont insert page breaks (form feed characters) between pages.",
        "[",
        "config file: textPageBreaks ]",
        "Insert a Unicode byte order marker (BOM) at the start of the text output.",
        "Specifies the left margin, in points.",
        "Text in the left margin (ie within that many points of the left edge of the page) is discarded.",
        "The default value is zero.",
        "Specifies the right margin, in points.",
        "Text in the right margin (i within that many points of the right edge of the page) is discarded.",
        "The default value is zero.",
        "Specifies the top margin, in points.",
        "Text in the top margin (ie within that many points of the top edge of the page) is discarded.",
        "The default value is zero.",
        "Specifies the bottom margin, in points.",
        "Text in the bottom margin (i within that many points of the bottom edge of the page) is discarded.",
        "The default value is zero.",
        "Specify the owner password for the PDF file.",
        "Providing this will bypass all security restrictions.",
        "Specify the user password for the PDF file.",
        "Dont print any messages or errors.",
        "[config file: errQuiet ]",
        "Read config-file in place of ~/ or the system-wide config file.",
        "List all available text output encodings, then exit.",
        "Print copyright and version information, then exit.",
        "Print usage information, then exit.",
        "Append to an existing output file instead of overwriting it.",
        "subtract the following monochrome image from all others processed.",
        "This can be used to remove a noise bias from a set of images.",
        "This bias image is typically an image of noise the camera saw with its shutter closed.",
        "Force output to be written with Big-Endian byte order.",
        "Suppress the use of ``strip chopping when reading images that have a single strip/tile of uncompressed data.",
        "Specify the compression to use for data written to the output file: none for no compression, packbits for PackBits compression, lzw for Lempel-Ziv & Welch compression, zip for Deflate compression, lzma for LZMA2 compression, jpeg for baseline JPEG compression, g3 for CCITT Group 3 (T) compression, g4 for CCITT Group 4 (T) compression, or sgilog for SGILOG compression.",
        "By default tiffcp will compress data according to the value of the Compression tag found in the source file.",
        "The CCITT Group 3 and Group 4 compression algorithms can only be used with bilevel data.",
        "Group 3 compression can be specified together with several T-specific options: 1d for 1-dimensional encoding, 2d for 2-dimensional encoding, and fill to force each encoded scanline to be zero-filled so that the terminating EOL code lies on a byte boundary.",
        "Group 3-specific options are specified by appending a ``:-separated list to the ``g3 option; eg.",
        "-c g3:2d:fill to get 2D-encoded data with byte-aligned EOL codes.",
        "LZW, Deflate and LZMA2 compression can be specified together with a predictor value.",
        "A predictor value of 2 causes each scanline of the output image to undergo horizontal differencing before it is encoded; a value of 1 forces each scanline to be encoded without differencing.",
        "A value 3 is for floating point predictor which you can use if the encoded data are in floating point format.",
        "LZW-specific options are specified by appending a ``:-separated list to the ``lzw option; eg.",
        "-c lzw:2 for LZW compression with horizontal differencing.",
        "Deflate and LZMA2 encoders support various compression levels (or encoder presets) set as character ``p and a preset number.",
        "``p1 is the fastest one with the worst compression ratio and ``p9 is the slowest but with the best possible ratio; eg.",
        "-c zip:3:p9 for Deflate encoding with maximum compression level and floating point predictor.",
        "For the Deflate codec, and in a libtiff build with libdeflate enabled, ``p12`` is actually the maximum level.",
        "For the Deflate codec, and in a libtiff build with libdeflate enabled, ``s0`` can be used to require zlib to be used, and ``s1`` for libdeflate (defaults to libdeflate when it is available).",
        "Specify the bit fill order to use in writing output data.",
        "By default, tiffcp will create a new file with the same fill order as the original.",
        "Specifying -f lsb2msb will force data to be written with the FillOrder tag set to LSB2MSB, while -f msb2lsb will force data to be written with the FillOrder tag set to MSB2LSB.",
        "Ignore non-fatal read errors and continue processing of the input file.",
        "Specify the length of a tile (in pixels).",
        "tiffcp attempts to set the tile dimensions so that no more than 8 kilobytes of data appear in a tile.",
        "Force output to be written with Little-Endian byte order.",
        "Suppress the use of memory-mapped files when reading images.",
        "Set initial directory offset.",
        "Specify the planar configuration to use in writing image data that has one 8-bit sample per pixel.",
        "By default, tiffcp will create a new file with the same planar configuration as the original.",
        "Specifying -p contig will force data to be written with multi-sample data packed together, while -p separate will force samples to be written in separate planes.",
        "Specify the number of rows (scanlines) in each strip of data written to the output file.",
        "By default (or when value 0 is specified), tiffcp attempts to set the rows/strip that no more than 8 kilobytes of data appear in a strip.",
        "If you specify special value -1 it will results in infinite number of the rows per strip.",
        "The entire image will be the one strip in that case.",
        "Force the output file to be written with data organized in strips (rather than tiles).",
        "Force the output file to be written with data organized in tiles (rather than strips).",
        "options can be used to force the resultant image to be written as strips or tiles of data, respectively.",
        "Specify the width of a tile (in pixels).",
        "tiffcp attempts to set the tile dimensions so that no more than 8 kilobytes of data appear in a tile.",
        "tiffcp attempts to set the tile dimensions so that no more than 8 kilobytes of data appear in a tile.",
        "Force the output file to be written with PAGENUMBER value in sequence.",
        "Write BigTIFF instead of classic TIFF format.",
        "substitute character for `, in parsing image directory indices in files.",
        "This is necessary if filenames contain commas.",
        "Note that -,= with whitespace immediately following will disable the special meaning of the `, entirely.",
        "See examples.",
        "Set maximum memory allocation size (in MiB).",
        "The default is 256MiB. Set to 0 to disable the limit.",
        "Display the syntax summary for tiffcrop.",
        "Report the current version and last modification date for tiffcrop.",
        "Specify one or more series or range(s) of images within each file to process.",
        "The words odd or even may be used to specify all odd or even numbered images counting from one.",
        "Note that internally, TIFF images are numbered from zero rather than one",
        "but since this convention is not obvious to most users, tiffcrop used 1 to specify the first image in a multipage file.",
        "The word last may be used in place of a number in the sequence to indicate the final image in the file without knowing how many images there are.",
        "Ranges of images may be specified with a dash and multiple sets can be indicated by joining them in a comma-separated list.",
        "eg.",
        "use -N 1,5-7,last to process the 1st, 5th through 7th, and final image in the file.",
        "Specify the top, bottom, left, or right edge as the reference from which to calculate the width and length of crop regions or sequence of positions for zones.",
        "When used with the -e option for exporting zones or regions, the reference edge determines how composite images are arranged.",
        "Using -E left or right causes successive zones or regions to be merged horizontally whereas using -E top or bottom causes successive zones or regions to be arranged vertically.",
        "This option has no effect on export layout when multiple zones or regions are not being exported to composite images.",
        "Edges may be abbreviated to the first letter.",
        "Specify the export mode for images and selections from input images.",
        "The final filename on the command line is considered to be the destination file or filename stem for automatically generated sequences of files.",
        "Modes may be abbreviated to the first letter.",
        "combined All images and selections are written to a single file with multiple selections from one image combined into a single image (default) divided All images and selections are written to a single file with each selection from one image written to a new image image",
        "Each input image is written to a new file (numeric filename sequence) with multiple selections from the image combined into one image multiple Each input image is written to a new file (numeric filename sequence) with each selection from the image written to a new image separate Individual selections from each image are written to separate files",
        "Specify the type of units to apply to dimensions for margins and crop regions for input and output images.",
        "Inches or centimeters are converted to pixels using the resolution unit specified in the TIFF file (which defaults to inches if not specified in the IFD).",
        "Specify margins to be removed from the input image.",
        "The order must be top, left, bottom, right with only commas separating the elements of the list.",
        "Margins are scaled according to the current units and removed before any other extractions are computed",
        "Set the horizontal (X-axis) dimension of a region to extract relative to the specified origin reference.",
        "If the origin is the top or bottom edge, the X axis value will be assumed to start at the left edge.",
        "Set the vertical (Y-axis) dimension of a region to extract relative to the specified origin reference.",
        "If the origin is the left or right edge, the Y axis value will be assumed to start at the top.",
        "Specify zones of the image designated as position X of Y equal sized portions measured from the reference edge, eg 1:3 would be first third of the image starting from the reference edge minus any margins specified for the confining edges.",
        "Multiple zones can be specified as a comma separated list but they must reference the same edge.",
        "To extract the top quarter and the bottom third of an image you would use -Z 1:4,3:3.",
        "Specify a series of coordinates to define regions for processing and exporting.",
        "The coordinates represent the top left and lower right corners of each region in the current units, eg inch, cm, or pixels.",
        "Pixels are counted from one to width or height and inches or cm are calculated from image resolution data.",
        "The first and third values represent the horizontal offsets of the corner points from the left edge while the second and fourth values represent the vertical offsets from the top edge.",
        "Flip, ie mirror, the image or extracted region horizontally or vertically.",
        "Rotate the image or extracted region 90, 180, or 270 degrees clockwise.",
        "Invert color space, eg dark to light for bilevel and grayscale images.",
        "This can be used to modify negative images to positive or to correct images that have the PHOTOMETRIC_INTERPRETATIN tag set incorrectly.",
        "If the value is black or white, the PHOTOMETRIC_INTERPRETATION tag is set to MinIsBlack or MinIsWhite, without altering the image data.",
        "If the argument is data or both, the data values of the image are modified.",
        "Specifying both inverts the data and the PHOTOMETRIC_INTERPRETATION tag, whereas using data inverts the data but not the PHOTOMETRIC_INTERPRETATION tag.",
        "No support for modifying the color space of color images in this release.",
        "Set the horizontal resolution of output images to # expressed in the current units.",
        "Set the vertical resolution of the output images to # expressed in the current units.",
        "Set the output orientation of the pages or sections.",
        "Auto will use the arrangement that requires the fewest pages.",
        "Format the output images to fit on page size paper.",
        "Use -P list to show the supported page sizes and dimensions.",
        "You can define a custom page size by entering the width and length of the page in the current units with the following format #x#.",
        "Divide each image into cols across and rows down equal sections.",
        "Force output to be written with Big-Endian byte order.",
        "Suppress the use of ``strip chopping when reading images that have a single strip/tile of uncompressed data.",
        "Specify the compression to use for data written to the output file: none for no compression, packbits for PackBits compression, lzw for Lempel-Ziv & Welch compression, jpeg for baseline JPEG compression.",
        "zip for Deflate compression, g3 for CCITT Group 3 (T) compression, and g4 for CCITT Group 4 (T) compression.",
        "By default tiffcrop will compress data according to the value of the Compression tag found in the source file.",
        "The CCITT Group 3 and Group 4 compression algorithms can only be used with bilevel data.",
        "Group 3 compression can be specified together with several T-specific options: 1d for 1-dimensional encoding, 2d for 2-dimensional encoding, and fill to force each encoded scanline to be zero-filled so that the terminating EOL code lies on a byte boundary.",
        "Group 3-specific options are specified by appending a ``:-separated list to the ``g3 option; eg.",
        "-c g3:2d:fill to get 2D-encoded data with byte-aligned EOL codes.",
        "LZW compression can be specified together with a predictor value.",
        "A predictor value of 2 causes each scanline of the output image to undergo horizontal differencing before it is encoded; a value of 1 forces each scanline to be encoded without differencing.",
        "LZW-specific options are specified by appending a ``:-separated list to the ``lzw option; eg.",
        "-c lzw:2 for LZW compression with horizontal differencing.",
        "Specify the bit fill order to use in writing output data.",
        "By default, tiffcrop will create a new file with the same fill order as the original.",
        "Specifying -f lsb2msb will force data to be written with the FillOrder tag set to LSB2MSB, while -f msb2lsb will force data to be written with the FillOrder tag set to MSB2LSB.",
        "Ignore non-fatal read errors and continue processing of the input file.",
        "Set maximum memory allocation size (in MiB).",
        "The default is 256MiB. Set to 0 to disable the limit.",
        "Specify the length of a tile (in pixels).",
        "Tiffcrop attempts to set the tile dimensions so that no more than 8 kilobytes of data appear in a tile.",
        "Force output to be written with Little-Endian byte order.",
        "Suppress the use of memory-mapped files when reading images.",
        "Specify the planar configuration to use in writing image data that has more than one sample per pixel.",
        "By default, tiffcrop will create a new file with the same planar configuration as the original.",
        "Specifying -p contig will force data to be written with multi-sample data packed together, while -p separate will force samples to be written in separate planes.",
        "Specify the number of rows (scanlines) in each strip of data written to the output file.",
        "By default (or when value 0 is specified), tiffcrop attempts to set the rows/strip that no more than 8 kilobytes of data appear in a strip.",
        "If you specify the special value -1 it will results in infinite number of the rows per strip.",
        "The entire image will be the one strip in that case.",
        "Force the output file to be written with data organized in strips (rather than tiles).",
        "Force the output file to be written with data organized in tiles (rather than strips).",
        "Specify the width of a tile (in pixels).",
        "tiffcrop attempts to set the tile dimensions so that no more than 8 kilobytes of data appear in a tile.",
        "tiffcrop attempts to set the tile dimensions so that no more than 8 kilobytes of data appear in a tile.",
        "Debug and dump facility -D opt1:value1,opt2:value2,opt3:value3:opt4:value4 Display program progress and/or dump raw data to non-TIFF files.",
        "Options include the following and must be joined as a comma separated list.",
        "The use of this option is generally limited to program debugging and development of future options.",
        "An equal sign may be substituted for the colon in option:value pairs.",
        "debug:N   Display limited program progress indicators where larger N increase the level of detail.",
        "format:txt|raw Format any logged data as ASCII text or raw binary values.",
        "ASCII text dumps include strings of ones and zeroes representing the binary values in the image data plus identifying headers.",
        "level:N   Specify the level of detail presented in the dump files.",
        "This can vary from dumps of the entire input or output image data to dumps of data processed by specific functions.",
        "Current range of levels is 1 to 3.",
        "input:full-path-to-directory/input-dumpname output:full-path-to-directory/output-dumpname When dump files are being written, each image will be written to a separate file with the name built by adding a numeric sequence value to the dumpname and an extension of for ASCII dumps or for binary dumps.",
        "The four debug/dump options are independent, though it makes little sense to specify a dump file without specifying a detail level.",
        "Note: Tiffcrop may be compiled with -DDEVELMODE to enable additional very low level debug reporting.",
        "Use an output audio buffer of approximately n kilobytes.",
        "Play all of the files named in the file playlist.",
        "The playlist should have one filename, directory name, or URL per line.",
        "Blank lines are permitted.",
        "Directories will be treated in the same way as on the command line.",
        "Use an input buffer of approximately n kilobytes.",
        "HTTP-only option.",
        "Prebuffer n percent of the input buffer.",
        "Playback wont begin until this prebuffer is complete.",
        "HTTP-only option.",
        "Specify output device.",
        "See DEVICES section for a list of devices.",
        "Any number of devices may be specified.",
        "Specify output file for a file device previously specified with --device.",
        "The filename - writes to standard out.",
        "If the file already exists, ogg123 will overwrite it.",
        "Show command help.",
        "Skip the first n seconds.",
        "n may also be in minutes:seconds or hours:minutes:seconds form.",
        "Stops playing n seconds from the start of the stream.",
        "n may also have the same format as used in the --skip option.",
        "Sets the option option to value for the preceding device.",
        "See DEVICES for a list of valid options for each device.",
        "Quiet mode.",
        "No messages are displayed.",
        "Display version information.",
        "Increase verbosity.",
        "Play every nth decoded block.",
        "Has the effect of playing audio at n times faster than normal speed.",
        "Repeat every played block n times.",
        "Has the effect of playing audio n times slower than normal speed.",
        "May be with -x for interesting fractional speeds.",
        "Repeat playlist indefinitely.",
        "Play files in pseudo-random order.",
        "Play files in pseudo-random order forever.",
        "Print out a usage message.",
        "The input format; the default is PEM.",
        "See openssl-format-options(1) for details.",
        "The input file, default is standard input.",
        "Output file to place the DER encoded data into.",
        "If this option is not present then no data will be output.",
        "This is most useful when combined with the -strparse option.",
        "Dont output the parsed version of the input file.",
        "Starting offset to begin parsing, default is start of file.",
        "Number of bytes to parse, default is until end of file.",
        "Indents the output according to the depth of the structures.",
        "A file containing additional OBJECT IDENTIFIERs (OIDs).",
        "The format of this file is described in the NOTES section below.",
        "Dump unknown data in hex format.",
        "Parse the contents octets of the ASN object starting at offset.",
        "This option can be used multiple times to drill down into a nested structure.",
        "Generate encoded data based on string, file or both using ASN1_generate_nconf(3) format.",
        "If file only is present then the string is obtained from the default section using the name asn1.",
        "The encoded data is passed through the ASN1 parser and printed out as though it came from a file, the contents can thus be examined and written to a file using the -out option.",
        "Without this option any data in a PEM format input file will be treated as being base64 encoded and processed whether it has the normal PEM BEGIN and END markers or not.",
        "This option will ignore any data prior to the start of the BEGIN marker, or after an END marker in a PEM file.",
        "Attempt to decode and print the data as an ASN1_ITEM name.",
        "This can be used to print out the fields of any supported ASN structure if the type is known.",
        "The output will typically contain lines like this: 0:d=0 hl=4 l= 681 cons: SEQUENCE .....",
        "229:d=3 hl=3 l= 141 prim:",
        "BIT STRING 373:d=2 hl=3 l= 162 cons: cont [ 3 ] 376:d=3 hl=3 l= 159 cons: SEQUENCE 379:d=4 hl=2 l= 29 cons: SEQUENCE 381:d=5 hl=2 l= 3 prim: OBJECT   :X509v3 Subject Key Identifier 386:d=5 hl=2 l= 22 prim: OCTET STRING 410:d=4 hl=2 l= 112 cons: SEQUENCE 412:d=5 hl=2 l= 3 prim: OBJECT   :",
        "X509v3 Authority Key Identifier 417:d=5 hl=2 l= 105 prim: OCTET STRING 524:d=4 hl=2 l= 12 cons: SEQUENCE .....",
        "This example is part of a self-signed certificate.",
        "Each line starts with the offset in decimal.",
        "W`d=XX specifies the current depth.",
        "The depth is increased within the scope of any SET or SEQUENCEs0 W`hl=XX gives the header length (tag and length octets) of the current type.",
        "W`l=XX gives the length of the contents octets.",
        "The -i option can be used to make the output more readable.",
        "Some knowledge of the ASN structure is needed to interpret the output.",
        "In this example the BIT STRING at offset 229 is the certificate public key.",
        "The contents octets of this will contain the public key information.",
        "This can be examined using the option W`-strparse 229 to yield: 0:d=0 hl=3 l= 137 cons: SEQUENCE 3:d=1 hl=3 l= 129 prim: INTEGER   :E5D21E1F5C8D208EA7A2166C7FAF9F6BDF2059669C60876DDB70840F1A5AAFA59699FE471F379F1DD6A487E7D5409AB6A88D4A9746E24B91D8CF55DB3521015460C8EDE44EE8A4189F7A7BE77D6CD3A9AF2696F486855CF58BF0EDF2B4068058C7A947F52548DDF7E15E96B385F86422BEA9064A3EE9E1158A56E4A6F47E5897 135:d=1 hl=2 l= 3 prim: INTEGER   :010001",
        "Use rc4v1 encryption",
        "Use rc4v2 encryption (Default value)",
        "Use aes encryption (currently not supported)",
        "Passwords",
        "An optional user password",
        "The required owner password  Permissions",
        "Allow printing the document",
        "Allow modification of the document besides annotations, form fields or changing pages",
        "Allow extraction of text and graphics",
        "Add or modify text annotations or form fields (if ePdfPermissions_Edit is set also allow the creation of interactive form fields including signature)",
        "Fill in existing form or signature fields",
        "Extract text and graphics to support user with disabillities",
        "Assemble the document:",
        "insert, create, rotate delete pages or add bookmarks",
        "Print a high resolution version of the document",
        "This option enables integrity checking of the file written to disk on decompression.",
        "All decompression is tested internally in lrzip with either crc32 or md5 hash checking depending on the version of the archive already.",
        "However the file written to disk may be corrupted for other reasons to do with other userspace problems such as faulty library versions, drivers, hardware failure and so on.",
        "Enabling this option will make lrzip perform an md5 hash check on the file thats written to disk.",
        "When the archive has the md5 value stored in it, it is compared to this.",
        "Otherwise it is compared to the value calculated during decompression.",
        "This offers an extra guarantee that the file written is the same as the original archived.",
        "Decompress.",
        "If this option is not used then lrzip looks at the name used to launch the program.",
        "If it contains the string lrunzip then the -d option is automatically set.",
        "If it contains the string lrzcat then the -d -o - options are automatically set.",
        "Encrypt.",
        "This option enables high grade password encryption using a combination of multiply sha512 hashed password, random salt and aes128 CBC encryption.",
        "Passwords up to 500 characters long are supported, and the encryption mechanism used virtually guarantees that the same file created with the same password will never be the same.",
        "Furthermore, the password hashing is increased according to the date the file is encrypted, increasing the number of CPU cycles required for each password attempt in accordance with Moores law, thus making the difficulty of attempting brute force attacks proportional to the power of modern computers.",
        "Print an options summary page",
        "This shows the md5 hash value calculated on compressing or decompressing an lrzip archive.",
        "By default all compression has the md5 value calculated and stored in all archives since version 060.",
        "On decompression, when an md5 value has been found, it will be calculated and used for integrity checking.",
        "If the md5 value is not stored in the archive, it will not be calculated unless explicitly specified with this option, or check integrity (see below) has been requested.",
        "This shows information about a compressed file.",
        "It shows the compressed size, the decompressed size, the compression ratio, what compression was used and what hash checking will be used for internal integrity checking.",
        "Note that the compression mode is detected from the first block only and it will show no compression used if the first block was incompressible, even if later blocks were compressible.",
        "If verbose options -v or -vv are added, a breakdown of all the internal blocks and progressively more information pertaining to them will also be shown.",
        "If this option is specified then lrzip will not show the percentage progress while compressing.",
        "Note that compression happens in bursts with lzma compression which is the default compression.",
        "This means that it will progress very rapidly for short periods and then stop for long periods.",
        "If this option is specified then lrzip will not show any output to the console except for error messages.",
        "If this option is specified, lrzip will recursively enter the directories specified, compressing or decompressing every file individually in the same directory.",
        "Note for better compression it is recommended to instead combine files in a tar file rather than compress them separately, either manually or with the lrztar helper.",
        "This tests the compressed file integrity.",
        "It does this by decompressing it to a temporary file and then deleting it.",
        "Increases verbosity.",
        "Print the lrzip version number",
        "If this option is specified then lrzip will delete the source file after successful compression or decompression.",
        "When this option is not specified then the source files are not deleted.",
        "If this option is not specified (Default) then lrzip will not overwrite any existing files.",
        "If you set this option then rzip will silently overwrite any files as needed.",
        "This option will keep broken or damaged files instead of deleting them.",
        "When compression or decompression is interrupted either by user or error, or a file decompressed fails an integrity check, it is normally deleted by LRZIP.",
        "Set the output file name.",
        "If this option is not set then the output file name is chosen based on the input name and the suffix.",
        "The -o option cannot be used if more than one file name is specified on the command line.",
        "Set the output directory for the default filename.",
        "Set the compression suffix.",
        "The default is lrz.",
        "Bzip2 compression.",
        "Uses bzip2 compression for the 2nd stage, much like the original rzip does.",
        "Gzip compression.",
        "Uses gzip compression for the 2nd stage.",
        "Uses libz compress and uncompress functions.",
        "LZO Compression.",
        "If this option is set then lrzip will use the ultra fast lzo compression algorithm for the 2nd stage.",
        "This mode of compression gives bzip2 like compression at the speed it would normally take to simply copy the file, giving excellent compression/time value.",
        "No 2nd stage compression.",
        "If this option is set then lrzip will only perform the long distance redundancy 1st stage compression.",
        "While this does not compress any faster than LZO compression, it produces a smaller file that then responds better to further compression (by eg another application), also reducing the compression time substantially.",
        "ZPAQ compression.",
        "Uses ZPAQ compression which is from the PAQ family of compressors known for having some of the highest compression ratios possible but at the cost of being extremely slow on both compress and decompress (4x slower than lzma which is the default).",
        "Set the compression level from 1 to 9.",
        "The default is to use level 7, which gives good all round compression.",
        "The compression level is also strongly related to how much memory lrzip uses.",
        "See the -w option for details.",
        "The default nice value is 19.",
        "This option can be used to set the priority scheduling for the lrzip backup or decompression.",
        "Valid nice values are from -20 to 19.",
        "Note this does NOT speed up or slow down compression.",
        "Set the number of processor count to determine the number of threads to run.",
        "Normally lrzip will scale according to the number of CPUs it detects.",
        "Using this will override the value in case you wish to use less CPUs to either decrease the load on your machine, or to improve compression.",
        "Setting it to 1 will maximise compression but will not attempt to use more than one CPU.",
        "Disables the LZ4 compressibility threshold testing when a slower compression back-end is used.",
        "LZ4 testing is normally performed for the slower back-end compression of LZMA and ZPAQ.",
        "The reasoning is that if it is completely incompressible by LZ4 then it will also be incompressible by them.",
        "Thus if a block fails to be compressed by the very fast LZ4, lrzip will not attempt to compress that block with the slower compressor, thereby saving time.",
        "If this option is enabled, it will bypass the LZ4 testing and attempt to compress each block regardless.",
        "Unlimited window size.",
        "If this option is set, and the file being compressed does not fit into the available ram, lrzip will use a moving second buffer as a sliding mmap which emulates having infinite ram.",
        "This will provide the most possible compression in the first rzip stage which can improve the compression of ultra large files when theyre bigger than the available ram.",
        "However it runs progressively slower the larger the difference between ram and the file size, so is best reserved for when the smallest possible size is desired on a very large file, and the time taken is not important.",
        "Set the maximum allowable compression window size to n in hundreds of megabytes.",
        "This is the amount of memory lrzip will search during its first stage of pre-compression and is the main thing that will determine how much benefit lrzip will provide over ordinary compression with the 2nd stage algorithm.",
        "If not set (recommended), the value chosen will be determined by an internal heuristic in lrzip which uses the most memory that is reasonable, without any hard upper limit.",
        "It is limited to 2GB on 32bit machines.",
        "lrzip will always reduce the window size to the biggest it can be without running out of memory.",
        "Enable perceptual enhancement (default)",
        "Disable perceptual enhancement",
        "Force decoding in narrowband",
        "Force decoding in wideband",
        "Force decoding in ultra-wideband",
        "Force decoding in mono",
        "Force decoding in stereo",
        "Force decoding at sampling rate n Hz",
        "Simulate n % random packet loss",
        "Verbose mode (show bit-rate)",
        "This help",
        "Version information",
        "Sets alternative destination directory where to save optimized files (default is to overwrite the originals).",
        "Please note that unchanged files wont be added to the destination directory.",
        "This means if the source file cant be compressed, no file will be created in the destination path.",
        "Force optimization, even if the result would be larger than the original file.",
        "Displays short usage information and exits.",
        "Sets the maximum image quality factor (disables lossless optimization mode, which is by default enabled).",
        "This option will reduce quality of those source files that were saved using higher quality setting.",
        "While files that already have lower quality setting will be compressed using the lossless optimization method.",
        "Valid values for quality parameter are: 0 - 100",
        "Dont really optimize files, just print results.",
        "Try to optimize file to given size (disables lossless optimization mode).",
        "Target size is specified either in kilobytes (1 - n) or as percentage (1% - 99%) of the original file size.",
        "Keep the file unchanged if the compression gain is lower than the threshold (%).",
        "Valid values for threshold are:",
        "0 - 100",
        "Set the maximum number of parallel processes to launch.",
        "(Default is 1)",
        "Print progress info in CSV format.",
        "Preserve file modification times.",
        "Preserve file permissions (owner/group) by overwriting the original file.",
        "This is slightly less safe than the default mode of operation (where new file is first saved as temporary file and then renamed over the original file).",
        "In this mode a backup of the original file is made with extension, and this file is removed after the original file has been successfully replaced.",
        "NOTE!",
        "if running jpegoptim as root there is generally no need to use this option, as jpegoptim is able to preserve file permissions when run by root in default mode.",
        "Quiet mode.",
        "Print totals after processing all files.",
        "Enables verbose mode (positively chatty).",
        "Force all output files to be non-progressive.",
        "Can be used to convert all input files to non-progressive JPEGs when used with --force option.",
        "Force all output files to be progressive.",
        "Can be used to convert all normal (non-progressive) JPEGs input files to progressive when used with --force option.",
        "Force all output files to use Arithmetic Coding.",
        "This option is experimental and only available if jpegoptim was compiled with Arithmetic Coding support enabled.",
        "Force all output files to use (traditional)",
        "Huffman coding.",
        "This option is experimental and only available if jpegoptim was compiled with Arithmetic Coding support enabled.",
        "Skip processing of any input files that have any errors/warnings during decompression.",
        "By default jpegoptim will attempt to optimize any file that it is able to decompress, even if decompression generates warnings.",
        "This will fix some (corrupt) JPEG images automatically.",
        "If this behaviour is not desired, this option can be used to make jpegoptim to skip any input files that contain any errors.",
        "Send output image to standard output.",
        "Note, if optimization didnt create smaller file than the input file, then no output original image is passed through unmodified (except any extra data after JPEG image will be discarded).",
        "Read input image from standard input and send output to standard output (--stdout is assumend when this option is used).",
        "When this option is used then only one image is read from standard input.",
        "Any (other) input files specified on command-line are ignored.",
        "Note, if input file - is seen on command line then standard input is also assumed.",
        "By default jpetoptim will keep common metadata (JPEG markers) and discard any other (unkown ones).",
        "Following markers are kept by default: - EXIF - IPTC - ICC - XMP - COM (JPEG Comment markers)",
        "JFIF marker will be regenerated (by libjpeg) during the process (this cannot be changed).",
        "However, Adobe marker is also generated (or omitted) by libjpeg based on the image colorspace, etc.",
        "This behavior depends on libjpeg library version being used.",
        "To make sure Adobe marker is preserved option --keep-adobe can be used.",
        "To remove additonal markers one or more the --strip-* options can be used.",
        "For example --strip-icc --strip-xmp --strip-com Alternatively it is possible to specify --strip-all and then one or more of the --keep-* options to explicitly list which markers to keep For example --strip-all --keep-exif --keep-iptc Options for controlling metadata (markers) in output files",
        "Strip all markers from output file.",
        "(NOTE! by default only Comment & Exif/IPTC/PhotoShop/ICC/XMP markers are kept, everything else is discarded).",
        "Output JPEG still likely will contains one or two markers (JFIF and Adobe APP14) depending on colorspace used in the image, as these markers are generated by the libjpeg encoder automatically.",
        "Preserve all markers in the image.",
        "This will leave all markers untouched in the image, except JFIF (APP0) and Adobe (APP14) markers as those get regenerated by the libjpeg library.",
        "NOTE!",
        "Strip Comment (COM) markers from output file.",
        "Strip EXIF markers from output file.",
        "Strip IPTC / Adobe Photoshop (APP13) markers from output file.",
        "Strip ICC profiles from output file.",
        "Strip XMP profiles from output file.",
        "Do not strip any JFXX (JFIF Extensions) from output file.",
        "Strip Adobe markers from output file.",
        "Do not strip any Comment (COM) markers from output file.",
        "Do not strip any EXIF markers from output file.",
        "Do not strip any IPTC / Adobe Photoshop (APP13) markers from output file.",
        "Do not strip any ICC profiles from output file.",
        "Do not strip any XMP profiles from output file.",
        "Do not strip Adobe markers from output file.",
        "Output the jq version and exit with zero.",
        "Use the application/json-seq MIME type scheme for separating JSON texts in jqs input and output.",
        "This means that an ASCII RS (record separator) character is printed before each value on output and an ASCII LF (line feed) is printed after every output.",
        "Input JSON texts that fail to parse are ignored (but warned about), discarding all subsequent input until the next RS.",
        "This mode also parses the output of jq without the --seq option.",
        "Parse the input in streaming fashion, outputing arrays of path and leaf values (scalars and empty arrays or empty objects).",
        "For example, a becomes [[],a], and [[],a,[b]] becomes [[0],[]], [[1],a], and [[1,0],b].",
        "This is useful for processing very large inputs.",
        "Use this in conjunction with filtering and the reduce and foreach syntax to reduce large inputs incrementally.",
        "Instead of running the filter for each JSON object in the input, read the entire input stream into a large array and run the filter just once.",
        "Dont parse the input as JSON.",
        "Instead, each line of text is passed to the filter as a string.",
        "If combined with --slurp, then the entire input is passed to the filter as a single long string.",
        "Dont read any input at all!",
        "Instead, the filter is run once using null as the input.",
        "This is useful when using jq as a simple calculator or to construct JSON data from scratch.",
        "By default, jq pretty-prints JSON output.",
        "Using this option will result in more compact output by instead putting each JSON object on a single line.",
        "Use a tab for each indentation level instead of two spaces.",
        "Use the given number of spaces (no more than 8) for indentation.",
        "By default, jq outputs colored JSON if writing to a terminal.",
        "You can force it to produce color even if writing to a pipe or a file using -C, and disable color with -M. Colors can be configured with the JQ_COLORS environment variable (see below).",
        "By default, jq outputs colored JSON if writing to a terminal.",
        "You can force it to produce color even if writing to a pipe or a file using -C, and disable color with -M. Colors can be configured with the JQ_COLORS environment variable (see below).",
        "jq usually outputs non-ASCII Unicode codepoints as UTF-8, even if the input specified them as escape sequences (like \\u03bc).",
        "Using this option, you can force jq to produce pure ASCII output with every non-ASCII character replaced with the equivalent escape sequence.",
        "Flush the output after each JSON object is printed (useful if youre piping a slow data source into jq and piping jqs output elsewhere).",
        "Output the fields of each object with the keys in sorted order.",
        "With this option, if the filters result is a string then it will be written directly to standard output rather than being formatted as a JSON string with quotes.",
        "This can be useful for making jq filters talk to non-JSON-based systems.",
        "Read filter from the file rather than from a command line, like awks -f option.",
        "You can also use # to make comments.",
        "Prepend directory to the search list for modules.",
        "If this option is used then no builtin search list is used.",
        "See the section on modules below.",
        "Sets the exit status of jq to 0 if the last output values was neither false nor null, 1 if the last output value was either false or null, or 4 if no valid result was ever produced.",
        "Normally jq exits with 2 if there was any usage problem or system error, 3 if there was a jq program compile error, or 0 if the jq program ran.",
        "Another way to set the exit status is with the halt_error builtin function.",
        "This option passes a value to the jq program as a predefined variable.",
        "If you run jq with --arg foo bar, then $foo is available in the program and has the value bar.",
        "Note that value will be treated as a string, so --arg foo 123 will bind $foo to 123.",
        "Named arguments are also available to the jq program as $ARGS.named.",
        "This option passes a JSON-encoded value to the jq program as a predefined variable.",
        "If you run jq with --argjson foo 123, then $foo is available in the program and has the value 123.",
        "This option reads all the JSON texts in the named file and binds an array of the parsed JSON values to the given global variable.",
        "If you run jq with --argfile foo bar, then $foo is available in the program and has an array whose elements correspond to the texts in the file named bar.",
        "Do not use.",
        "Remaining arguments are positional string arguments.",
        "These are available to the jq program as $ARGS.positional[].",
        "Remaining arguments are positional JSON text arguments.",
        "These are available to the jq program as $ARGS.positional[].",
        "Runs the tests in the given file or standard input.",
        "The input consists of comment lines, empty lines, and program lines followed by one input line, as many lines of output as are expected (one per output), and a terminating empty line.",
        "Compilation failure tests start with a line containing only %%FAIL, then a line containing the program to compile, then a line containing an error message to compare to the actual.",
        "Be warned that this option can change backwards-incompatibly.",
        "Perform optimization of entropy encoding parameters.",
        "Create progressive JPEG file.",
        "Emit a JPEG restart marker every N MCU rows, or every N MCU blocks if B is attached to the number.",
        "Use arithmetic coding.",
        "Use the scan script given in the specified text file.",
        "See cjpeg (1) for more details about these switches.",
        "If you specify none of these switches, you get a plain baseline-JPEG output file.",
        "The quality setting and so forth are determined by the input file.",
        "The image can be losslessly transformed by giving one of these switches",
        "Mirror image horizontally (left-right).",
        "Mirror image vertically (top-bottom).",
        "Rotate image 90 degrees clockwise.",
        "Rotate image 180 degrees.",
        "Rotate image 270 degrees clockwise (or 90 ccw).",
        "Transpose image (across UL-to-LR axis).",
        "Transverse transpose (across UR-to-LL axis).",
        "The transpose transformation has no restrictions regarding image dimensions.",
        "The other transformations operate rather oddly if the image dimensions are not a multiple of the iMCU size (usually 8 or 16 pixels), because they can only transform complete blocks of DCT coefficient data in the desired way.",
        "jpegtran s default behavior when transforming an odd-size image is designed to preserve exact reversibility and mathematical consistency of the transformation set.",
        "As stated, transpose is able to flip the entire image area.",
        "Horizontal mirroring leaves any partial iMCU column at the right edge untouched, but is able to flip all rows of the image.",
        "Similarly, vertical mirroring leaves any partial iMCU row at the bottom edge untouched, but is able to flip all columns.",
        "The other transforms can be built up as sequences of transpose and flip operations; for consistency, their actions on edge pixels are defined to be the same as the end result of the corresponding transpose-and-flip sequence.",
        "For practical use, you may prefer to discard any untransformable edge pixels rather than having a strange-looking strip along the right and/or bottom edges of a transformed image.",
        "To do this, add the -trim switch:",
        "Drop non-transformable edge blocks.",
        "Obviously, a transformation with -trim is not reversible, so strictly speaking jpegtran with this switch is not lossless.",
        "Also, the expected mathematical equivalences between the transformations no longer hold.",
        "For example, -rot 270 -trim trims only the bottom edge, but -rot 90 -trim followed by -rot 180 -trim trims both edges.",
        "If you are only interested in perfect transformations, add the -perfect switch.",
        "This causes jpegtran to fail with an error if the transformation is not perfect.",
        "For example, you may want to do (jpegtran -rot 90 -perfect foojpg || djpeg foojpg | pnmflip -r90 | cjpeg) to do a perfect rotation, if available, or an approximated one if not.",
        "This version of jpegtran also offers a lossless crop option, which discards data outside of a given image region but losslessly preserves what is inside.",
        "Like the rotate and flip transforms, lossless crop is restricted by the current JPEG format; the upper left corner of the selected region must fall on an iMCU boundary.",
        "If it doesnt, then it is silently moved up and/or left to the nearest iMCU boundary (the lower right corner is unchanged",
        "Thus, the output image covers at least the requested region, but it may cover more.",
        "The adjustment of the region dimensions may be optionally disabled by attaching an f character (force) to the width or height number.",
        "The image can be losslessly cropped by giving the switch:",
        "Crop the image to a rectangular region of width W and height H, starting at point X,Y.",
        "The lossless crop feature discards data outside of a given image region but losslessly preserves what is inside.",
        "Like the rotate and flip transforms, lossless crop is restricted by the current JPEG format; the upper left corner of the selected region must fall on an iMCU boundary.",
        "If it doesnt, then it is silently moved up and/or left to the nearest iMCU boundary (the lower right corner is unchanged If W or H is larger than the width/height of the input image, then the output image is expanded in size, and the expanded region is filled in with zeros (neutral gray).",
        "Attaching an f character (flatten) to the width number will cause each block in the expanded region to be filled in with the DC coefficient of the nearest block in the input image rather than grayed out.",
        "Attaching an r character (reflect) to the width number will cause the expanded region to be filled in with repeated reflections of the input image rather than grayed out.",
        "A complementary lossless wipe option is provided to discard (gray out) data inside a given image region while losslessly preserving what is outside:",
        "Wipe (gray out) a rectangular region of width W and height H from the input image, starting at point X,Y. Attaching an f character (flatten) to the width number will cause the region to be filled with the average of adjacent blocks rather than grayed out.",
        "If the wipe region and the region outside the wipe region, when adjusted to the nearest iMCU boundary, form two horizontally adjacent rectangles, then attaching an r character (reflect) to the width number will cause the wipe region to be filled with repeated reflections of the outside region rather than grayed out.",
        "A lossless drop option is also provided, which allows another JPEG image to be inserted (dropped) into the input image data at a given position, replacing the existing image data at that position:",
        "Drop (insert) another image at point X,Y",
        "Both the input image and the drop image must have the same subsampling level.",
        "It is best if they also have the same quantization (quality Otherwise, the quantization of the output image will be adapted to accommodate the higher of the input image quality and the drop image quality.",
        "The trim option can be used with the drop option to requantize the drop image to match the input image.",
        "Note that a grayscale image can be dropped into a full-color image or vice versa, as long as the full-color image has no vertical subsampling.",
        "If the input image is grayscale and the drop image is full-color, then the chrominance channels from the drop image will be discarded.",
        "Other not-strictly-lossless transformation switches are",
        "Force grayscale output.",
        "This option discards the chrominance channels if the input image is YCbCr (ie, a standard color JPEG), resulting in a grayscale JPEG file.",
        "The luminance channel is preserved exactly, so this is a better method of reducing to grayscale than decompression, conversion, and recompression.",
        "This switch is particularly handy for fixing a monochrome picture that was mistakenly encoded as a color JPEG.",
        "(In such a case, the space savings from getting rid of the near-empty chroma channels wont be large; but the decoding time for a grayscale JPEG is substantially less than that for a color JPEG jpegtran also recognizes these switches that control what to do with extra markers, such as comment blocks:",
        "Copy no extra markers from source file.",
        "This setting suppresses all comments and other metadata in the source file.",
        "Copy only comment markers.",
        "This setting copies comments from the source file but discards any other metadata.",
        "Copy only ICC profile markers.",
        "This setting copies the ICC profile from the source file but discards any other metadata.",
        "Copy all extra markers.",
        "This setting preserves miscellaneous markers found in the source file, such as JFIF thumbnails, Exif data, and Photoshop settings.",
        "In some files, these extra markers can be sizable.",
        "Note that this option will copy thumbnails as-is; they will not be transformed.",
        "The default behavior is -copy comments.",
        "(Note: in IJG releases v6 and v6a, jpegtran always did the equivalent of -copy none Additional switches recognized by jpegtran",
        "are",
        "Embed ICC color management profile contained in the specified file.",
        "Set limit for amount of memory to use in processing large images.",
        "Value is in thousands of bytes, or millions of bytes if M is attached to the number.",
        "For example, -max 4m selects 4000000 bytes.",
        "If more space is needed, an error will occur.",
        "Abort if the input image contains more than N scans.",
        "This feature demonstrates a method by which applications can guard against denial-of-service attacks instigated by specially-crafted malformed JPEG images containing numerous scans with missing image data or image data consisting only of EOB runs (a feature of progressive JPEG images that allows potentially hundreds of thousands of adjoining zero-value pixels to be represented using only a few bytes Attempting to transform such malformed JPEG images can cause excessive CPU activity, since the decompressor must fully process each scan (even if the scan is corrupt) before it can proceed to the next scan.",
        "Send output image to the named file, not to standard output.",
        "Report transformation progress.",
        "Treat all warnings as fatal.",
        "This feature also demonstrates a method by which applications can guard against attacks instigated by specially-crafted malformed JPEG images.",
        "Enabling this option will cause the decompressor to abort if the input image contains incomplete or corrupt image data.",
        "Enable debug printout.",
        "More -v s give more output.",
        "Also, version information is printed at startup.",
        "Print version information and exit.",
        "Enable debugging output.",
        "This option may appear up to 1 times.",
        "This option takes an integer number as its argument.",
        "The value of number is constrained to being: +4 in the range 0 through 5 -4",
        "The default number for this option is: +4 0",
        "If configured with --enable-debug, then you can specify a verbosity level for debugging output.",
        "Higher numbers increase verbosity.",
        "Quiet mode.",
        "Print nothing except the statistics at the end of the run",
        "Select packet timing mode: select, ioport, gtod, nano.",
        "This option may appear up to 1 times.",
        "The default string for this option is: +4 gtod Allows you to select the packet timing method to use nano - Use nanosleep() API select - Use select() API ioport - Write to the i386 IO Port 0x80 gtod [default] - Use a gettimeofday()",
        "loop",
        "Sleep for no more then X milliseconds between packets.",
        "This option takes an integer number as its argument.",
        "The default number for this option is: +4 0",
        "Set a limit for the maximum number of milliseconds that tcpreplay will sleep between packets.",
        "Effectively prevents long delays between packets without effecting the majority of packets.",
        "Default is disabled.",
        "Print decoded packets via tcpdump to STDOUT.",
        "This option may appear up to 1 times.",
        "Arguments passed to tcpdump decoder.",
        "This option may appear up to 1 times.",
        "When enabling verbose mode (-v) you may also specify one or more additional arguments to pass to tcpdump to modify the way packets are decoded.",
        "Be sure to quote the arguments like: -A -axxx so that they are not interpreted by tcpreplay.",
        "Please see the tcpdump(1) man page for a complete list of options.",
        "Preloads packets into RAM before sending.",
        "This option loads the specified pcap(s) into RAM before starting to send in order to improve replay performance while introducing a startup performance hit.",
        "Preloading can be used with or without --loop.",
        "This option also suppresses flow statistics collection for every iteration, which can significantly reduce memory usage.",
        "Flow statistics are predicted based on options supplied and statistics collected from the first loop iteration.",
        "Split traffic via a tcpprep cache file.",
        "This option may appear up to 1 times.",
        "If you have a pcap file you would like to use to send bi-directional traffic through a device (firewall, router, IDS, etc) then using tcpprep you can create a cachefile which tcpreplay will use to split the traffic across two network interfaces.",
        "Replay two files at a time from a network tap.",
        "This option may appear up to 1 times.",
        "If you captured network traffic using a network tap, then you can end up with two pcap files-",
        "one for each direction.",
        "This option will replay these two files at the same time, one on each interface and inter-mix them using the timestamps in each.",
        "Client to server/RX/primary traffic output interface.",
        "This option may appear up to 1 times.",
        "Required network interface used to send either all traffic or traffic which is marked as primary via tcpprep.",
        "Primary traffic is usually client-to-server or inbound (RX) on khial virtual interfaces.",
        "Server to client/TX/secondary traffic output interface.",
        "This option may appear up to 1 times.",
        "Optional network interface used to send traffic which is marked as secondary via tcpprep.",
        "Secondary traffic is usually server-to-client or outbound (TX) on khial virtual interfaces.",
        "List available network interfaces and exit.",
        "Loop through the capture file X times.",
        "This option may appear up to 1 times.",
        "This option takes an integer number as its argument.",
        "The value of number is constrained to being: +4 greater than or equal to 0 -4",
        "The default number for this option is: +4 1",
        "Delay between loops in milliseconds.",
        "This option takes an integer number as its argument.",
        "The value of number is constrained to being: +4 greater than or equal to 0 -4",
        "The default number for this option is: +4 0",
        "Override the snaplen and use the actual packet len.",
        "This option may appear up to 1 times.",
        "By default, tcpreplay will send packets based on the size of the snaplen stored in the pcap file which is usually the correct thing to do.",
        "However, occasionally, tools will store more bytes then told to.",
        "By specifying this option, tcpreplay will ignore the snaplen field and instead try to send packets based on the original packet length.",
        "Bad things may happen if you specify this option.",
        "Limit the number of packets to send.",
        "This option may appear up to 1 times.",
        "This option takes an integer number as its argument.",
        "The value of number is constrained to being: +4 greater than or equal to 1 -4",
        "The default number for this option is: +4 -1",
        "By default, tcpreplay will send all the packets.",
        "Alternatively, you can specify a maximum number of packets to send.",
        "Limit the number of seconds to send.",
        "This option may appear up to 1 times.",
        "This option takes an integer number as its argument.",
        "The value of number is constrained to being: +4 greater than or equal to 1 -4",
        "The default number for this option is: +4 -1",
        "By default, tcpreplay will send all the packets.",
        "Alternatively, you can specify a maximum number of seconds to transmit.",
        "Modify replay speed to a given multiple.",
        "This option may appear up to 1 times.",
        "Specify a value to modify the packet replay speed.",
        "Examples: 2 will replay traffic at twice the speed captured 0 will replay traffic at 70%",
        "the speed captured",
        "Replay packets at a given packets/sec.",
        "This option may appear up to 1 times.",
        "Specify a value to regulate the packet replay to a specific packet-per-second rate.",
        "Examples: 200 will replay traffic at 200 packets per second 05 will replay traffic at 15 packets per minute",
        "Replay packets at a given Mbps.",
        "This option may appear up to 1 times.",
        "Specify a floating point value for the Mbps rate that tcpreplay should send packets at.",
        "Replay packets as fast as possible.",
        "Replay one packet at a time for each user input.",
        "Allows you to step through one or more packets at a time.",
        "Number of packets to send for each time interval.",
        "This option takes an integer number as its argument.",
        "The value of number is constrained to being: +4 greater than or equal to 1 -4",
        "The default number for this option is: +4 1 When trying to send packets at very high rates, the time between each packet can be so short that it is impossible to accurately sleep for the required period of time.",
        "This option allows you to send multiple packets at a time, thus allowing for longer sleep times which can be more accurately implemented.",
        "Modify IP addresses each loop iteration to generate unique flows.",
        "Ensure IPv4 and IPv6 packets will be unique for each --loop iteration.",
        "This is done in a way that will not alter packet CRC, and therefore will generally not affect performance.",
        "This option will significantly increase the flows/sec over generated over multiple loop iterations.",
        "Number of times to loop before assigning new unique ip.",
        "This option may appear up to 1 times.",
        "Number of --loop iterations before a new unique IP is assigned.",
        "Default is 1.",
        "Write packets directly to netmap enabled network adapter.",
        "This feature will detect netmap capable network drivers on Linux and BSD systems.",
        "If detected, the network driver is bypassed for the execution duration, and network buffers will be written to directly.",
        "This will allow you to achieve full line rates on commodity network adapters, similar to rates achieved by commercial network traffic generators.",
        "Note that bypassing the network driver will disrupt other applications connected through the test interface.",
        "See INSTALL for more information.",
        "This feature can also be enabled by specifying an interface as netmap:<intf> or vale:<intf>.",
        "For example netmap:",
        "eth0 specifies netmap over interface eth0.",
        "Netmap startup delay.",
        "This option takes an integer number as its argument.",
        "The default number for this option is: +4 10 Number of seconds to delay after netmap is loaded.",
        "Required to ensure interfaces are fully up before netmap transmit.",
        "Requires netmap option.",
        "Default is 10 seconds.",
        "Suppress printing and tracking flow count, rates and expirations.",
        "Suppress the collection and printing of flow statistics.",
        "This option may improve performance when not using --preload-pcap option, otherwise its only function is to suppress printing.",
        "The flow feature will track and print statistics of the flows being sent.",
        "A flow is loosely defined as a unique combination of a 5-tuple, ie. source IP, destination IP, source port, destination port and protocol.",
        "If --loop is specified, the flows from one iteration to the next will not be unique, unless the packets are altered.",
        "Use --unique-ip or tcpreplay-edit to alter packets between iterations.",
        "Number of inactive seconds before a flow is considered expired.",
        "This option takes an integer number as its argument.",
        "The value of number is constrained to being: +4 greater than or equal to 0 -4",
        "The default number for this option is: +4 0",
        "This option will track and report flow expirations based on the flow idle times.",
        "The timestamps within the pcap file are used to determine the expiry, not the actual timestamp of the packets are replayed.",
        "For example, a value of 30 suggests that if no traffic is seen on a flow for 30 seconds, any subsequent traffic would be considered a new flow, and thereby will increment the flows and flows per second (fps) statistics.",
        "This option can be used to optimize flow timeout settings for flow products.",
        "Setting the timeout low may lead to flows being dropped when in fact the flow is simply slow to respond.",
        "Configuring your flow timeouts too high may increase resources required by your flow product.",
        "Note that using this option while replaying at higher than original speeds can lead to inflated flows and fps counts.",
        "Default is 0 (no expiry) and a typical value is 30-120 seconds.",
        "Print the PID of tcpreplay at startup.",
        "Print statistics every X seconds, or every loop if 0.",
        "This option takes an integer number as its argument.",
        "The value of number is constrained to being: +4 greater than or equal to 0 -4",
        "Note that timed delays are a best effort and long delays between sending packets may cause equally long delays between printing statistics.",
        "Print version information.",
        "Display less usage information and exit.",
        "Display usage information and exit.",
        "Pass the extended usage information through a pager.",
        "Save the option state to cfgfile.",
        "The default is the last configuration file listed in the OPTION PRESETS section, below.",
        "The command will exit after updating the config file.",
        "Load options from cfgfile.",
        "The no-load-opts form will disable the loading of earlier config/rc/ini files.",
        "--no-load-opts is handled early, out of order.",
        "Any option that is not marked as not presettable may be preset by loading values from configuration (RC or file(s).",
        "The homerc file is $$/, unless that is a directory.",
        "In that case, the file tcpreplayrc is searched for within that directory.",
        "Enable debugging output.",
        "This option may appear up to 1 times.",
        "This option takes an integer number as its argument.",
        "The value of number is constrained to being: +4 in the range 0 through 5 -4",
        "The default number for this option is: +4 0",
        "If configured with --enable-debug, then you can specify a verbosity level for debugging output.",
        "Higher numbers increase verbosity.",
        "Auto-split mode.",
        "This option may appear up to 1 times.",
        "Tcpprep will try to automatically determine the primary function of hosts based on the traffic captured and classify each host as client or server.",
        "In order to do so, you must provide a hint to tcpprep as to how to search for clients and servers.",
        "Valid hints are: bridge Bridge mode processes each packet to try to determine if the sender is a client or server.",
        "If tcpprep is unable to determine what role a system plays, tcpprep will abort.",
        "router Router mode works just like bridge mode, except that after weighing is done, systems which are undetermined are considered a server if they fall inside a network known to contain other servers.",
        "Router has a greater chance of successfully splitting clients and servers but is not 100% foolproof.",
        "client Client mode works just like bridge mode, except that unclassified systems are treated as clients.",
        "Client mode should always complete successfully.",
        "server Server mode works just like bridge mode, except that unclassified systems are treated as servers.",
        "Server mode should always complete successfully.",
        "first First mode works by looking at the first time each IP is seen in the SRC and DST fields in the IP header.",
        "If the host is first seen in the SRC field, it is a client and if its first seen in the DST field, it is marked as a server.",
        "This effectively replicates the processing of the tomahawk test tool.",
        "First mode should always complete successfully.",
        "CIDR-split mode.",
        "This option may appear up to 1 times.",
        "Specify a comma delimited list of CIDR netblocks to match against the source IP of each packet.",
        "Packets matching any of the CIDRs are classified as servers.",
        "IPv4 Example --cidr=19268/16,1726/12,10/8 IPv6 Example: --cidr=[::ffff:0:0/96],[fe80::/16]",
        "Regex-split mode.",
        "This option may appear up to 1 times.",
        "Specify a regular expression to match against the source IP of each packet.",
        "Packets matching the regex are classified as servers.",
        "Port-split mode.",
        "This option may appear up to 1 times.",
        "Specifies that TCP and UDP traffic over IPv4 and IPv6 should be classified as client or server based upon the destination port of the header.",
        "Source MAC split mode.",
        "This option may appear up to 1 times.",
        "Specify a list of MAC addresses to match against the source MAC of each packet.",
        "Packets matching one of the values are classified as servers.",
        "Matches to be client instead of server.",
        "This option may appear up to 1 times.",
        "Normally the --mac, --regex and --cidr flags specify are used to specify the servers and non-IP packets are classified as clients.",
        "By using --reverse, these features are reversed so that the flags specify clients and non-IP packets are classified as servers.",
        "Embedded cache file comment.",
        "This option may appear up to 1 times.",
        "Specify a comment to be imbedded within the output cache file and later viewed.",
        "Do not embed any cache file comment.",
        "This option may appear up to 1 times.",
        "By default, tcpprep includes the arguments passed on the command line in the cache file comment (in addition to any user specified --comment).",
        "If for some reason you do not wish to include this, specify this option.",
        "Include only packets matching rule.",
        "This option may appear up to 1 times.",
        "Override default of processing all packets stored in the capture file and only send/edit packets which match the provided rule.",
        "Rules can be one of: S:<CIDR1>, - Source IP must match specified IPv4/v6 CIDR(s) D:<CIDR1>, - Destination IP must match specified IPv4/v6 CIDR(s)",
        "B:<CIDR1>, - Both source and destination IP must match specified IPv4/v6 CIDR(s) E:<CIDR1>, - Either IP must match specified IPv4/v6 CIDR(s)",
        "P:<LIST> - Must be one of the listed packets where the list corresponds to the packet number in the capture file.",
        "-x P:1-5,9,15,72- would process packets 1 through 5, the 9th and 15th packet, and packets 72 until the end of the file F:<bpf> - BPF filter.",
        "See the tcpdump(8) man page for syntax.",
        "Exclude any packet matching this rule.",
        "This option may appear up to 1 times.",
        "Override default of processing all packets stored in the capture file and only send/edit packets which do NOT match the provided rule.",
        "Rules can be one of: S:<CIDR1>, - Source IP must not match specified IPv4/v6 CIDR(s) D:<CIDR1>, - Destination IP must not match specified IPv4/v6 CIDR(s) B:<CIDR1>, - Both source and destination IP must not match specified IPv4/v6 CIDR(s) E:<CIDR1>, - Either IP must not match specified IPv4/v6 CIDR(s) P:<LIST> - Must not be one of the listed packets where the list corresponds to the packet number in the capture file.",
        "-x P:1-5,9,15,72- would skip packets 1 through 5, the 9th and 15th packet, and packets 72 until the end of the file",
        "Output cache file.",
        "This option may appear up to 1 times.",
        "Input pcap file to process.",
        "This option may appear up to 1 times.",
        "Print embedded comment in the specified cache file.",
        "This option may appear up to 1 times.",
        "Print basic info from the specified cache file.",
        "This option may appear up to 1 times.",
        "Print statistical information about the specified cache file.",
        "This option may appear up to 1 times.",
        "Load services file for server ports.",
        "This option may appear up to 1 times.",
        "Uses a list of ports used by servers in the same format as of /etc/services <service_name>  <port>/<protocol> # comment Example http   80/tcp",
        "Send non-IP traffic out server interface.",
        "This option may appear up to 1 times.",
        "By default, non-IP traffic which can not be classified as client or server is classified as client.",
        "Specifying --nonip will reclassify non-IP traffic as server.",
        "Note that the meaning of this flag is reversed if --reverse is used.",
        "Ratio of client to server packets.",
        "This option may appear up to 1 times.",
        "The default string for this option is: +4 2",
        "Since a given host may have both client and server traffic being sent to/from it, tcpprep uses a ratio to weigh these packets.",
        "If you would like to override the default of 2:1 server to client packets required for a host to be classified as a server, specify it as a floating point value.",
        "Minimum network mask length in auto mode.",
        "This option may appear up to 1 times.",
        "This option takes an integer number as its argument.",
        "The value of number is constrained to being: +4 in the range 0 through 32 -4",
        "The default number for this option is: +4 30 By default, auto modes use a minimum network mask length of 30 bits to build networks containing clients and servers.",
        "This allows you to override this value.",
        "Larger values will increase performance but may provide inaccurate results.",
        "Maximum network mask length in auto mode.",
        "This option may appear up to 1 times.",
        "This option takes an integer number as its argument.",
        "The value of number is constrained to being: +4 in the range 0 through 32 -4",
        "The default number for this option is: +4 8 By default, auto modes use a maximum network mask length of 8 bits to build networks containing clients and servers.",
        "This allows you to override this value.",
        "Larger values will decrease performance and accuracy but will provide greater chance of success.",
        "Print decoded packets via tcpdump to STDOUT.",
        "This option may appear up to 1 times.",
        "Arguments passed to tcpdump decoder.",
        "This option may appear up to 1 times.",
        "When enabling verbose mode (-v) you may also specify one or more additional arguments to pass to tcpdump to modify the way packets are decoded.",
        "By default, -n and -l are used.",
        "Be sure to quote the arguments so that they are not interpreted by tcprewrite.",
        "The following arguments are valid: [ -aAeNqRStuvxX ] [ -E spi@ipaddr algo:secret,. ]",
        "[ -s snaplen ]",
        "Print version information.",
        "Display less usage information and exit.",
        "This option has not been fully documented.",
        "Display usage information and exit.",
        "Pass the extended usage information through a pager.",
        "Save the option state to cfgfile.",
        "The default is the last configuration file listed in the OPTION PRESETS section, below.",
        "The command will exit after updating the config file.",
        "Load options from cfgfile.",
        "The no-load-opts form will disable the loading of earlier config/rc/ini files.",
        "--no-load-opts is handled early, out of order.",
        "Any option that is not marked as not presettable may be preset by loading values from configuration (RC or file(s).",
        "The homerc file is $$/, unless that is a directory.",
        "In that case, the file tcppreprc is searched for within that directory.",
        "File is an ELF core dump file.",
        "File is a debug only ELF file (separate or dwz multi-file).",
        "File looks like an ELF object or archive/static library (default).",
        "File is an ELF archive or static library.",
        "File is an regular ELF object (not an archive/static library).",
        "File is (primarily) an ELF program executable (not primarily a DSO)",
        "File is an ELF shared object (DSO) (might also be an executable).",
        "File is a linux kernel module.",
        "File is a loadable ELF object (program or shared object).",
        "File is an ELF program executable (might also be a DSO).",
        "File is (primarily) an ELF shared object (DSO) (not primarily an executable).",
        "File is an ELF file with symbol table or sections and can be stripped further.",
        "Only classify regular (not symlink nor special device) files.",
        "Do not read files from standard input (default).",
        "Also read file names to process from standard input, separated by newlines.",
        "Also read file names to process from standard input, separated by ASCII NUL bytes.",
        "Try to open compressed files or embedded (kernel) ELF images.",
        "If printing file names, print matching files (default).",
        "Do not output file names.",
        "If printing file names, print files that do not match.",
        "Output names of files, separated by newline.",
        "Output names of files, separated by ASCII NUL.",
        "Output additional information (can be specified multiple times).",
        "Give this help list.",
        "Give a short usage message.",
        "Print program version.",
        "For the specified frame number, assign the given comment string.",
        "Can be repeated for multiple frames.",
        "Quotes should be used with comment strings that include spaces.",
        "Reads only the packets whose timestamp is on or after start time.",
        "The time is given in ISO 8601 format, either YYYY-MM-DD HH:MM:SS[ or YYYY-MM-DDTHH:MM:SS[ .",
        "The fractional seconds are optional, as is the time zone offset from UTC (in which case local time is assumed).",
        "Unix epoch timestamps (floating point format) are also accepted.",
        "Reads only the packets whose timestamp is before stop time.",
        "The time is given in ISO 8601 format, either YYYY-MM-DD HH:MM:SS[ or YYYY-MM-DDTHH:MM:SS[ .",
        "The fractional seconds are optional, as is the time zone offset from UTC (in which case local time is assumed).",
        "Unix epoch timestamps (floating point format) are also accepted.",
        "Splits the packet output to different files based on uniform packet counts with a maximum of <packets per file> each.",
        "Each output file will be created with an infix _nnnnn[_YYYYmmddHHMMSS] inserted before the file extension (which may be null) of outfile.",
        "The infix consists of the ordinal number of the output file, starting with 00000, followed by the timestamp of its first packet.",
        "The timestamp is omitted if the input file does not contain timestamp information.",
        "After the specified number of packets is written to the output file, the next output file is opened.",
        "The default is to use a single output file.",
        "Sets the chop length to use when writing the packet data.",
        "Each packet is chopped by <choplen> bytes of data.",
        "Positive values chop at the packet beginning while negative values chop at the packet end.",
        "If an optional offset precedes the <choplen>, then the bytes chopped will be offset from that value.",
        "Positive offsets are from the packet beginning, while negative offsets are from the packet end.",
        "This is useful for chopping headers for decapsulation of an entire capture, removing tunneling headers, or in the rare case that the conversion between two file formats leaves some random bytes at the end of each packet.",
        "Another use is for removing vlan tags.",
        "n sp 1 an-trap an-no-space-flag 1 an-break-flag 1 +1 Note -1",
        "This option can be used more than once, effectively allowing you to chop bytes from up to two different areas of a packet in a single pass provided that you specify at least one chop length as a positive value and at least one as a negative value.",
        "All positive chop lengths are added together as are all negative chop lengths.",
        "Attempts to remove duplicate packets.",
        "The length and MD5 hash of the current packet are compared to the previous four (4) packets.",
        "If a match is found, the current packet is skipped.",
        "Attempts to remove duplicate packets.",
        "The length and MD5 hash of the current packet are compared to the previous <dup window> - 1 packets.",
        "If a match is found, the current packet is skipped.",
        "The use of the option -D 0 combined with the -V option is useful in that each packet’s Packet number, Len and MD5 Hash will be printed to standard error.",
        "This verbose output (specifically the MD5 hash strings) can be useful in scripts to identify duplicate packets across trace files.",
        "The <dup window> is specified as an integer value between 0 and 1000000 (inclusive).",
        "n sp 1 an-trap an-no-space-flag 1 an-break-flag 1 +1 Note -1",
        "Specifying large <dup window> values with large tracefiles can result in very long processing times for editcap.",
        "Sets the probability that bytes in the output file are randomly changed.",
        "Editcap uses that probability (between 0 and 1 inclusive) to apply errors to each data byte in the file.",
        "For instance, a probability of 02 means that each byte has a 2% chance of having an error.",
        "This option is meant to be used for fuzz-testing protocol dissectors.",
        "Sets the file format of the output capture file.",
        "Editcap can write the file in several formats, editcap -F provides a list of the available output formats.",
        "The default is the pcapng format.",
        "Prints the version and options and exits.",
        "Splits the packet output to different files based on uniform time intervals using a maximum interval of <seconds per file> each.",
        "Floating point values (e 0) are allowed.",
        "Each output file will be created with an infix _nnnnn[_YYYYmmddHHMMSS] inserted before the file extension (which may be null) of outfile.",
        "The infix consists of the ordinal number of the output file, starting with 00000, followed by the timestamp of its first packet.",
        "The timestamp is omitted if the input file does not contain timestamp information.",
        "After packets for the specified time interval are written to the output file, the next output file is opened.",
        "The default is to use a single output file.",
        "Ignore the specified number of bytes at the beginning of the frame during MD5 hash calculation, unless the frame is too short, then the full frame is used.",
        "Useful to remove duplicated packets taken on several routers (different mac addresses for example) e -I 26 in case of Ether/IP will ignore ether(14) and IP header(20 - 4(src ip) - 4(dst ip)).",
        "The default value is 0.",
        "Adjust the original frame length accordingly when chopping and/or snapping (in addition to the captured length, which is always adjusted regardless of whether -L is specified or not).",
        "See also -C <choplen> and -s <snaplen>.",
        "When used in conjunction with -E, skip some bytes from the beginning of the packet from being changed.",
        "In this way some headers don’t get changed, and the fuzzer is more focused on a smaller part of the packet.",
        "Keeping a part of the packet fixed the same dissector is triggered, that make the fuzzing more precise.",
        "Reverse the packet selection.",
        "Causes the packets whose packet numbers are specified on the command line to be written to the output capture file, instead of discarding them.",
        "Sets the snapshot length to use when writing the data.",
        "If the -s flag is used to specify a snapshot length, packets in the input file with more captured data than the specified snapshot length will have only the amount of data specified by the snapshot length written to the output file.",
        "This may be useful if the program that is to read the output file cannot handle packets larger than a certain size (for example, the versions of snoop in Solaris 2 and Solaris 2 appear to reject Ethernet packets larger than the standard Ethernet MTU, making them incapable of handling gigabit Ethernet captures if jumbo packets were used).",
        "When used in conjunction with -E, set the seed for the pseudo-random number generator.",
        "This is useful for recreating a particular sequence of errors.",
        "Skip the radiotap header of each frame when checking for packet duplicates.",
        "This is useful when processing a capture created by combining outputs of multiple capture devices on the same channel in the vicinity of each other.",
        "Time adjust selected packets to ensure strict chronological order.",
        "The <strict time adjustment> value represents relative seconds specified as seconds[ seconds].",
        "As the capture file is processed each packet’s absolute time is possibly adjusted to be equal to or greater than the previous packet’s absolute timestamp depending on the <strict time adjustment> value.",
        "If <strict time adjustment> value is 0 or greater (e 000001) then only packets with a timestamp less than the previous packet will adjusted.",
        "The adjusted timestamp value will be set to be equal to the timestamp value of the previous packet plus the value of the <strict time adjustment> value.",
        "A <strict time adjustment> value of 0 will adjust the minimum number of timestamp values necessary to ensure that the resulting capture file is in strict chronological order.",
        "If <strict time adjustment> value is specified as a negative value, then the timestamp values of all packets will be adjusted to be equal to the timestamp value of the previous packet plus the absolute value of the <strict time adjustment> value.",
        "A <strict time adjustment> value of -0 will result in all packets having the timestamp value of the first packet.",
        "This feature is useful when the trace file has an occasional packet with a negative delta time relative to the previous packet.",
        "Sets the time adjustment to use on selected packets.",
        "If the -t flag is used to specify a time adjustment, the specified adjustment will be applied to all selected packets in the capture file.",
        "The adjustment is specified as seconds[ seconds].",
        "For example, -t 3600 advances the timestamp on selected packets by one hour while -t -0 reduces the timestamp on selected packets by one-half second.",
        "This feature is useful when synchronizing dumps collected on different machines where the time difference between the two machines is known or can be estimated.",
        "Sets the packet encapsulation type of the output capture file.",
        "If the -T flag is used to specify an encapsulation type, the encapsulation type of the output capture file will be forced to the specified type.",
        "editcap -T provides a list of the available types.",
        "The default type is the one appropriate to the encapsulation type of the input capture file.",
        "Note: this merely forces the encapsulation type of the output file to be the specified type; the packet headers of the packets will not be translated from the encapsulation type of the input capture file to the specified encapsulation type (for example, it will not translate an Ethernet capture to an FDDI capture if an Ethernet capture is read and -T fddi is specified).",
        "If you need to remove/add headers from/to a packet, you will need od(1)/text2pcap(1).",
        "Print the version and exit.",
        "Causes editcap to print verbose messages while it’s working.",
        "Use of -V with the de-duplication switches of -d, -D or -w will cause all MD5 hashes to be printed whether the packet is skipped or not.",
        "Attempts to remove duplicate packets.",
        "The current packet’s arrival time is compared with up to 1000000 previous packets.",
        "If the packet’s relative arrival time is less than or equal to the <dup time window> of a previous packet and the packet length and MD5 hash of the current packet are the same then the packet to skipped.",
        "The duplicate comparison test stops when the current packet’s relative arrival time is greater than <dup time window>.",
        "The <dup time window> is specified as seconds[ seconds].",
        "The [ seconds] component can be specified to nine (9) decimal places (billionths of a second) but most typical trace files have resolution to six (6) decimal places (millionths of a second).",
        "n sp 1 an-trap an-no-space-flag 1 an-break-flag 1 +1 Note -1",
        "Specifying large <dup time window> values with large tracefiles can result in very long processing times for editcap.",
        "n sp",
        "1 an-trap an-no-space-flag 1 an-break-flag 1 +1 Note -1",
        "The -w option assumes that the packets are in chronological order.",
        "If the packets are NOT in chronological order then the -w duplication removal option may not identify some duplicates.",
        "Inserts the contents of <file> into a Decryption Secrets Block (DSB) within the pcapng output file.",
        "This enables decryption without requiring additional configuration in protocol preferences.",
        "The file format is described by <secrets type> which can be one of tls TLS Key Log as described at c https://developer wg WireGuard Key Log, see c https://gitlab This option may be specified multiple times.",
        "The available options for <secrets type> can be listed with --inject-secrets help.",
        "Discard all decryption secrets from the input file when writing the output file.",
        "Does not discard secrets added by --inject-secrets in the same command line.",
        "Adds the given comment to the output file, if supported by the output file format.",
        "New comments will be added after any comments present in the input file unless --discard-capture-comment is also specified.",
        "This option may be specified multiple times.",
        "Note that Wireshark currently only displays the first comment of a capture file.",
        "Discard all capture file comments from the input file when writing the output file.",
        "Does not discard comments added by --capture-comment in the same command line.",
        "Set the active log level.",
        "Supported levels in lowest to highest order are noisy, debug, info, message, warning, critical, and error.",
        "Messages at each level and higher will be printed, for example warning prints warning, critical, and error messages and noisy prints all messages.",
        "Levels are case insensitive.",
        "Abort the program if any messages are logged at the specified level or higher.",
        "For example, warning aborts on any warning, critical, or error messages.",
        "Only print messages for the specified log domains, e GUI,Epan,sshdump.",
        "List of domains must be comma-separated.",
        "Force the specified domains to log at the debug level.",
        "List of domains must be comma-separated.",
        "Force the specified domains to log at the noisy level.",
        "List of domains must be comma-separated.",
        "Write log messages and stderr output to the specified file."
    ],
    "IDC": [
        [
            "Force output to be written with Big-Endian byte order.",
            "Force output to be written with Little-Endian byte order."
        ],
        [
            "Force the output file to be written with data organized in strips (rather than tiles).",
            "Force the output file to be written with data organized in tiles (rather than strips)."
        ],
        [
            "Render soft breaks (newlines inside paragraphs in the CommonMark source) as hard line breaks in the target format.",
            "Render soft breaks as spaces."
        ],
        [
            "These options encrypt the private key with the DES, triple DES, IDEA or any other cipher supported by OpenSSL before outputting it.",
            "These options encrypt the private key with the DES, triple DES, IDEA or any other cipher supported by OpenSSL before outputting it."
        ],
        [
            "Enable Strong PVK encoding level (default).",
            "Enable Weak PVK encoding level."
        ],
        [
            "These options encrypt the private key with the specified cipher before outputting it.",
            "These options encrypt the private key with the specified cipher before outputting it."
        ],
        [
            "Enable Strong PVK encoding level (default).",
            "Dont enforce PVK encoding."
        ],
        [
            "Enable Weak PVK encoding level.",
            "Dont enforce PVK encoding."
        ],
        [
            "generate a sixel image for 7bit terminals or printers (default).",
            "generate a sixel image for 8bit terminals or printers."
        ],
        [
            "output monochrome sixel image.",
            "output 15bpp sixel image"
        ],
        [
            "Generate grayscale Level 2 PostScript.",
            "Generate Level 3 separable PostScript."
        ],
        [
            "Generate Level 2 PostScript.",
            "Generate Level 3 PostScript."
        ],
        [
            "Generate Level 2 separable PostScript.",
            "Generate Level 3 separable PostScript."
        ],
        [
            "Generate Level 2 PostScript.",
            "Generate grayscale Level 3 PostScript."
        ],
        [
            "Generate grayscale Level 2 PostScript.",
            "Generate Level 2 separable PostScript."
        ],
        [
            "Generate Level 1 PostScript.",
            "Generate grayscale Level 3 PostScript."
        ],
        [
            "Generate grayscale Level 3 PostScript.",
            "Generate Level 3 separable PostScript."
        ],
        [
            "Generate Level 1 separable PostScript.",
            "Generate Level 3 PostScript."
        ],
        [
            "Generate Level 1 PostScript.",
            "Generate grayscale Level 2 PostScript."
        ],
        [
            "Generate grayscale Level 2 PostScript.",
            "Generate grayscale Level 3 PostScript."
        ],
        [
            "Generate Level 2 PostScript.",
            "Generate Level 3 separable PostScript."
        ],
        [
            "Generate Level 2 separable PostScript.",
            "Generate Level 3 PostScript."
        ],
        [
            "Generate Level 1 PostScript.",
            "Generate Level 3 separable PostScript."
        ],
        [
            "Generate Level 1 separable PostScript.",
            "Generate Level 2 separable PostScript."
        ],
        [
            "Generate Level 1 PostScript.",
            "Generate Level 2 separable PostScript."
        ],
        [
            "Generate Level 2 PostScript.",
            "Generate grayscale Level 2 PostScript."
        ],
        [
            "Generate Level 1 separable PostScript.",
            "Generate Level 3 separable PostScript."
        ],
        [
            "Generate Level 1 PostScript.",
            "Generate Level 1 separable PostScript."
        ],
        [
            "Generate Level 1 separable PostScript.",
            "Generate grayscale Level 2 PostScript."
        ],
        [
            "Generate Level 1 PostScript.",
            "Generate Level 3 PostScript."
        ],
        [
            "Generate Level 3 PostScript.",
            "Generate grayscale Level 3 PostScript."
        ],
        [
            "Generate Level 3 PostScript.",
            "Generate Level 3 separable PostScript."
        ],
        [
            "Generate Level 2 PostScript.",
            "Generate Level 2 separable PostScript."
        ],
        [
            "Generate Level 2 separable PostScript.",
            "Generate grayscale Level 3 PostScript."
        ],
        [
            "Generate grayscale Level 2 PostScript.",
            "Generate Level 3 PostScript."
        ],
        [
            "Generate Level 1 separable PostScript.",
            "Generate grayscale Level 3 PostScript."
        ],
        [
            "Generate Level 1 separable PostScript.",
            "Generate Level 2 PostScript."
        ],
        [
            "Generate Level 1 PostScript.",
            "Generate Level 2 PostScript."
        ],
        [
            "Play files in pseudo-random order.",
            "Play files in pseudo-random order forever."
        ],
        [
            "Use rc4v1 encryption",
            "Use rc4v2 encryption (Default value)"
        ],
        [
            "Bzip2 compression.",
            "LZO Compression."
        ],
        [
            "Bzip2 compression.",
            "No 2nd stage compression."
        ],
        [
            "Bzip2 compression.",
            "ZPAQ compression."
        ],
        [
            "LZO Compression.",
            "No 2nd stage compression."
        ],
        [
            "LZO Compression.",
            "ZPAQ compression."
        ],
        [
            "No 2nd stage compression.",
            "ZPAQ compression."
        ],
        [
            "Gzip compression.",
            "Bzip2 compression."
        ],
        [
            "Gzip compression.",
            "LZO Compression."
        ],
        [
            "Gzip compression.",
            "No 2nd stage compression."
        ],
        [
            "Gzip compression.",
            "ZPAQ compression."
        ],
        [
            "Enable perceptual enhancement (default)",
            "Disable perceptual enhancement"
        ],
        [
            "Force decoding in narrowband",
            "Force decoding in wideband"
        ],
        [
            "Force decoding in narrowband",
            "Force decoding in ultra-wideband"
        ],
        [
            "Force decoding in narrowband",
            "Force decoding in mono"
        ],
        [
            "Force decoding in narrowband",
            "Force decoding in stereo"
        ],
        [
            "Force decoding in narrowband",
            "Force decoding at sampling rate n Hz"
        ],
        [
            "Force decoding in wideband",
            "Force decoding in ultra-wideband"
        ],
        [
            "Force decoding in wideband",
            "Force decoding in mono"
        ],
        [
            "Force decoding in wideband",
            "Force decoding in stereo"
        ],
        [
            "Force decoding in wideband",
            "Force decoding at sampling rate n Hz"
        ],
        [
            "Force decoding in ultra-wideband",
            "Force decoding in mono"
        ],
        [
            "Force decoding in ultra-wideband",
            "Force decoding in stereo"
        ],
        [
            "Force decoding in ultra-wideband",
            "Force decoding at sampling rate n Hz"
        ],
        [
            "Force decoding in mono",
            "Force decoding in stereo"
        ],
        [
            "Force decoding in mono",
            "Force decoding at sampling rate n Hz"
        ],
        [
            "Force decoding in stereo",
            "Force decoding at sampling rate n Hz"
        ],
        [
            "Strip all markers from output file.",
            "Strip Comment (COM) markers from output file."
        ],
        [
            "Strip all markers from output file.",
            "Strip EXIF markers from output file."
        ],
        [
            "Strip all markers from output file.",
            "Strip IPTC / Adobe Photoshop (APP13) markers from output file."
        ],
        [
            "Strip all markers from output file.",
            "Strip ICC profiles from output file."
        ],
        [
            "Strip all markers from output file.",
            "Strip XMP profiles from output file."
        ],
        [
            "Strip all markers from output file.",
            "Do not strip any JFXX (JFIF Extensions) from output file."
        ],
        [
            "Strip all markers from output file.",
            "Strip Adobe markers from output file."
        ],
        [
            "Strip Comment (COM) markers from output file.",
            "Do not strip any Comment (COM) markers from output file."
        ],
        [
            "Strip EXIF markers from output file.",
            "Do not strip any EXIF markers from output file."
        ],
        [
            "Strip IPTC / Adobe Photoshop (APP13) markers from output file.",
            "Do not strip any IPTC / Adobe Photoshop (APP13) markers from output file."
        ],
        [
            "Strip ICC profiles from output file.",
            "Do not strip any ICC profiles from output file."
        ],
        [
            "Strip XMP profiles from output file.",
            "Do not strip any XMP profiles from output file."
        ],
        [
            "Strip Adobe markers from output file.",
            "Do not strip Adobe markers from output file."
        ],
        [
            "Force all output files to be non-progressive.",
            "Force all output files to be progressive."
        ],
        [
            "Force all output files to use Arithmetic Coding.",
            "Force all output files to use (traditional)"
        ],
        [
            "By default, jq outputs colored JSON if writing to a terminal.",
            "By default, jq outputs colored JSON if writing to a terminal."
        ],
        [
            "Remaining arguments are positional string arguments.",
            "Remaining arguments are positional JSON text arguments."
        ],
        [
            "Embedded cache file comment.",
            "Do not embed any cache file comment."
        ],
        [
            "Auto-split mode.",
            "CIDR-split mode."
        ],
        [
            "Auto-split mode.",
            "Regex-split mode."
        ],
        [
            "Auto-split mode.",
            "Port-split mode."
        ],
        [
            "Auto-split mode.",
            "Source MAC split mode."
        ],
        [
            "CIDR-split mode.", 
            "Regex-split mode."
        ],
        [
            "CIDR-split mode.", 
            "Port-split mode."
        ],
        [   
            "CIDR-split mode.", 
            "Source MAC split mode."
        ],
        [
            "Regex-split mode.", 
            "Port-split mode."
        ],
        [
            "Regex-split mode.", 
            "Source MAC split mode."
        ],
        [
            "Replay packets at a given packets/sec.", 
            "Replay packets at a given Mbps."
        ],
        [
            "Replay packets at a given packets/sec.", 
            "Replay packets as fast as possible."
        ],
        [
            "Replay packets at a given Mbps.", 
            "Replay packets as fast as possible."
        ],
        [
            "File is an ELF core dump file.",
            "File is a debug only ELF file (separate or dwz multi-file)."
        ],
        [
            "File is an ELF core dump file.",
            "File looks like an ELF object or archive/static library (default)."
        ],
        [
            "File is an ELF core dump file.",
            "File is an ELF archive or static library."
        ],
        [
            "File is an ELF core dump file.",
            "File is an regular ELF object (not an archive/static library)."
        ],
        [
            "File is an ELF core dump file.",
            "File is (primarily) an ELF program executable (not primarily a DSO)"
        ],
        [
            "File is an ELF core dump file.",
            "File is an ELF shared object (DSO) (might also be an executable)."
        ],
        [
            "File is an ELF core dump file.",
            "File is a linux kernel module."
        ],
        [
            "File is an ELF core dump file.",
            "File is a loadable ELF object (program or shared object)."
        ],
        [
            "File is an ELF core dump file.",
            "File is an ELF program executable (might also be a DSO)."
        ],
        [
            "File is an ELF core dump file.",
            "File is (primarily) an ELF shared object (DSO) (not primarily an executable)."
        ],
        [
            "File is an ELF core dump file.",
            "File is an ELF file with symbol table or sections and can be stripped further."
        ],
        [
            "File is a debug only ELF file (separate or dwz multi-file).",
            "File looks like an ELF object or archive/static library (default)."
        ],
        [
            "File is a debug only ELF file (separate or dwz multi-file).",
            "File is an ELF archive or static library."
        ],
        [
            "File is a debug only ELF file (separate or dwz multi-file).",
            "File is an regular ELF object (not an archive/static library)."
        ],
        [
            "File is a debug only ELF file (separate or dwz multi-file).",
            "File is (primarily) an ELF program executable (not primarily a DSO)"
        ],
        [
            "File is a debug only ELF file (separate or dwz multi-file).",
            "File is an ELF shared object (DSO) (might also be an executable)."
        ],
        [
            "File is a debug only ELF file (separate or dwz multi-file).",
            "File is a linux kernel module."
        ],
        [
            "File is a debug only ELF file (separate or dwz multi-file).",
            "File is a loadable ELF object (program or shared object)."
        ],
        [
            "File is a debug only ELF file (separate or dwz multi-file).",
            "File is an ELF program executable (might also be a DSO)."
        ],
        [
            "File is a debug only ELF file (separate or dwz multi-file).",
            "File is (primarily) an ELF shared object (DSO) (not primarily an executable)."
        ],
        [
            "File is a debug only ELF file (separate or dwz multi-file).",
            "File is an ELF file with symbol table or sections and can be stripped further."
        ],
        [
            "File looks like an ELF object or archive/static library (default).",
            "File is an ELF archive or static library."
        ],
        [
            "File looks like an ELF object or archive/static library (default).",
            "File is an regular ELF object (not an archive/static library)."
        ],
        [
            "File looks like an ELF object or archive/static library (default).",
            "File is (primarily) an ELF program executable (not primarily a DSO)"
        ],
        [
            "File looks like an ELF object or archive/static library (default).",
            "File is an ELF shared object (DSO) (might also be an executable)."
        ],
        [
            "File looks like an ELF object or archive/static library (default).",
            "File is a linux kernel module."
        ],
        [
            "File looks like an ELF object or archive/static library (default).",
            "File is a loadable ELF object (program or shared object)."
        ],
        [
            "File looks like an ELF object or archive/static library (default).",
            "File is an ELF program executable (might also be a DSO)."
        ],
        [
            "File looks like an ELF object or archive/static library (default).",
            "File is (primarily) an ELF shared object (DSO) (not primarily an executable)."
        ],
        [
            "File looks like an ELF object or archive/static library (default).",
            "File is an ELF file with symbol table or sections and can be stripped further."
        ],
        [
            "File is an ELF archive or static library.",
            "File is an regular ELF object (not an archive/static library)."
        ],
        [
            "File is an ELF archive or static library.",
            "File is (primarily) an ELF program executable (not primarily a DSO)"
        ],
        [
            "File is an ELF archive or static library.",
            "File is an ELF shared object (DSO) (might also be an executable)."
        ],
        [
            "File is an ELF archive or static library.",
            "File is a linux kernel module."
        ],
        [
            "File is an ELF archive or static library.",
            "File is a loadable ELF object (program or shared object)."
        ],
        [
            "File is an ELF archive or static library.",
            "File is an ELF program executable (might also be a DSO)."
        ],
        [
            "File is an ELF archive or static library.",
            "File is (primarily) an ELF shared object (DSO) (not primarily an executable)."
        ],
        [
            "File is an ELF archive or static library.",
            "File is an ELF file with symbol table or sections and can be stripped further."
        ],
        [
            "File is an regular ELF object (not an archive/static library).",
            "File is (primarily) an ELF program executable (not primarily a DSO)"
        ],
        [
            "File is an regular ELF object (not an archive/static library).",
            "File is an ELF shared object (DSO) (might also be an executable)."
        ],
        [
            "File is an regular ELF object (not an archive/static library).",
            "File is a linux kernel module."
        ],
        [
            "File is an regular ELF object (not an archive/static library).",
            "File is a loadable ELF object (program or shared object)."
        ],
        [
            "File is an regular ELF object (not an archive/static library).",
            "File is an ELF program executable (might also be a DSO)."
        ],
        [
            "File is an regular ELF object (not an archive/static library).",
            "File is (primarily) an ELF shared object (DSO) (not primarily an executable)."
        ],
        [
            "File is an regular ELF object (not an archive/static library).",
            "File is an ELF file with symbol table or sections and can be stripped further."
        ],
        [
            "File is (primarily) an ELF program executable (not primarily a DSO)",
            "File is an ELF shared object (DSO) (might also be an executable)."
        ],
        [
            "File is (primarily) an ELF program executable (not primarily a DSO)",
            "File is a linux kernel module."
        ],
        [
            "File is (primarily) an ELF program executable (not primarily a DSO)",
            "File is a loadable ELF object (program or shared object)."
        ],
        [
            "File is (primarily) an ELF program executable (not primarily a DSO)",
            "File is an ELF program executable (might also be a DSO)."
        ],
        [
            "File is (primarily) an ELF program executable (not primarily a DSO)",
            "File is (primarily) an ELF shared object (DSO) (not primarily an executable)."
        ],
        [
            "File is (primarily) an ELF program executable (not primarily a DSO)",
            "File is an ELF file with symbol table or sections and can be stripped further."
        ],
        [
            "File is an ELF shared object (DSO) (might also be an executable).",
            "File is a linux kernel module."
        ],
        [
            "File is an ELF shared object (DSO) (might also be an executable).",
            "File is a loadable ELF object (program or shared object)."
        ],
        [
            "File is an ELF shared object (DSO) (might also be an executable).",
            "File is an ELF program executable (might also be a DSO)."
        ],
        [
            "File is an ELF shared object (DSO) (might also be an executable).",
            "File is (primarily) an ELF shared object (DSO) (not primarily an executable)."
        ],
        [
            "File is an ELF shared object (DSO) (might also be an executable).",
            "File is an ELF file with symbol table or sections and can be stripped further."
        ],
        [
            "File is a linux kernel module.",
            "File is a loadable ELF object (program or shared object)."
        ],
        [
            "File is a linux kernel module.",
            "File is an ELF program executable (might also be a DSO)."
        ],
        [
            "File is a linux kernel module.",
            "File is (primarily) an ELF shared object (DSO) (not primarily an executable)."
        ],
        [
            "File is a linux kernel module.",
            "File is an ELF file with symbol table or sections and can be stripped further."
        ],
        [
            "File is a loadable ELF object (program or shared object).",
            "File is an ELF program executable (might also be a DSO)."
        ],
        [
            "File is a loadable ELF object (program or shared object).",
            "File is (primarily) an ELF shared object (DSO) (not primarily an executable)."
        ],
        [
            "File is a loadable ELF object (program or shared object).",
            "File is an ELF file with symbol table or sections and can be stripped further."
        ],
        [
            "File is an ELF program executable (might also be a DSO).",
            "File is (primarily) an ELF shared object (DSO) (not primarily an executable)."
        ],
        [
            "File is an ELF program executable (might also be a DSO).",
            "File is an ELF file with symbol table or sections and can be stripped further."
        ],
        [
            "File is (primarily) an ELF shared object (DSO) (not primarily an executable).",
            "File is an ELF file with symbol table or sections and can be stripped further."
        ],
        [
            "Also read file names to process from standard input, separated by newlines.",
            "Also read file names to process from standard input, separated by ASCII NUL bytes."
        ],
        [
            "Do not output file names.",
            "Output names of files, separated by newline."
        ],
        [
            "Do not output file names.",
            "Output names of files, separated by ASCII NUL."
        ],
        [
            "Output names of files, separated by newline.",
            "Output names of files, separated by ASCII NUL."
        ],
        [
            "Attempts to remove duplicate packets.",
            "Attempts to remove duplicate packets."
        ]
    ]
}